{
  "content": "# Part One",
  "children": [
    {
      "content": "# Characters",
      "children": [
        {
          "content": "# Gray"
        },
        {
          "content": "# Lyric"
        },
        {
          "content": "# Haven"
        },
        {
          "content": "# Unclaimed names + titles\n\n- King of Curses; the Cursed King\n- The Executrix"
        }
      ]
    },
    {
      "content": "# Places",
      "children": [
        {
          "content": "# Gray's Mountains\n\n- Machu Picchu (mountainous empire)\n- San Francisco (fog)\n- Olympic forest (temperate rainforest)\n- Guangxi (karsts)",
          "children": [
            {
              "content": "# Mountain features",
              "children": [
                {
                  "content": "# Mountains\n\nIt's a giant mountain range with many parts and a long history.\n\n![](https://www.filepicker.io/api/file/o4WPVsOKQsi2LkpzKc5z)"
                },
                {
                  "content": "# Valley\n\nWithin the mountain are many valleys where the Fernborn have settled. Lots of space for fog to settle.\n\n![](https://www.filepicker.io/api/file/FTzNueZRAqdfVdWuAnb3)"
                },
                {
                  "content": "# Fog\n\nThe microclimate of the Valley results in seasonal fog. From spring to autumn, the valley is covered in various levels of fog. Only in the winter does the fog clear, granting full display of the short days and shallow light.\n\n<figure>\n  ![Fog creeping up a mountainside and pooling in the ancient moats that surround each peak](https://www.filepicker.io/api/file/R4RyQ4E7RCQUNBTM6Qsg)\n  <figcaption>\n    <cite>[Wang Qiuren](http://www.artlinkart.com/en/artist/exh_yr/5e6bywm)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Peaks\n\nThe peak visible from around the Valley are important for orientation and are considered sacred by many.\n\n![](https://www.filepicker.io/api/file/4TMG63NeRASMRDCLXMnN)"
                },
                {
                  "content": "# Caves\n\nThe Valley has many cave systems. Some were settled, but those have since been sealed due to \"dangers.\" The caves are said to hold nightmares and bad luck. Few Valley residents question the decision or desire exploring, happily keeping above ground.\n\n<figure>\n  ![Abandoned caves whose stalagmites and stalagtites frame the light-filled entrance like the maw of a beast](https://www.filepicker.io/api/file/NpIwbIyzTKGPDc1ZmCao)\n  <figcaption>\n    <cite>[Nathanael M](https://artlanding.artstation.com/projects/OyqmNJ)</cite>\n  </figcaption>\n</figure>"
                }
              ]
            },
            {
              "content": "# Mountain fauna",
              "children": [
                {
                  "content": "# Monsters\n\nThere legends of monsters looming in the fog. Their stories were used to keep kids away from the woods but maybe some of the tales hold truth (i.e. symbionts). Tales often contain details of glowing eyes, moans and whispers, silhouettes.\n\n![](https://www.filepicker.io/api/file/RyD6fp3aToqPX5u9lAst)"
                },
                {
                  "content": "# Salamanders\n\nIn the wet mountains, many salamanders live in seasonal pools and stream beds. Their migration patterns sometimes symbolize the pilgrimage of the Fernborn. Some salamanders are quite poisonous and have been long used for healing and harm.\n\n![](https://www.filepicker.io/api/file/CGdWk7vvRnOcTuVfirz2)"
                },
                {
                  "content": "# Snails\n\nThere are a bunch of snails; they co-evolved with the moist environment.\n\nSnail shells are collected and used for games and made into jewelry. Maybe there's something interesting about the chirality of the snail shell.\n\n![](https://www.filepicker.io/api/file/PMQjhtKXRJW916jODCYV)\n\n- [108 Martyr Snails](https://www.luckymojo.com/eyeofbuddha.html) (unsubstantiated)\n- [Why Are There So Many Snails In Medieval Manuscripts?](https://justhistoryposts.com/2017/11/13/medieval-marginalia-why-are-there-so-many-snails-in-medieval-manuscripts/)"
                }
              ]
            },
            {
              "content": "# Mountain flora",
              "children": [
                {
                  "content": "# Bromeliads\n\nThey hold pools of water for little critters!\n\n![](https://www.filepicker.io/api/file/kwh8YpMjTeqrHN3Cz2JY)"
                },
                {
                  "content": "# Carnivorous plants\n\nThere are a lot of bugs and so there are a lot of bug-eating plants. Maybe a metaphor for the rich consuming the poor?\n\n![](https://www.filepicker.io/api/file/J3hyDEUQS2qc7lxa5LlC)"
                },
                {
                  "content": "# Orchids\n\nMany plants have strong smells to attract pollinators who have limited visual signals in the fog. The Valley is well know particularly for its orchids.\n\n![](https://www.filepicker.io/api/file/SPssKtGgSWivcNlJEZOy)"
                },
                {
                  "content": "# Moss and lichen\n\nAlong with ferns, the fog provides a perfect environment for moss and lichen.\n\n![](https://www.filepicker.io/api/file/ko08tpTjRzyyglDpTcIW)"
                },
                {
                  "content": "# Ferns\n\nThe Valley is unique in the diversity and longevity of its native ferns. Many ferns have been cultivated by family groups over the years, used as a territory-marking method and as an indicator of lineage and legacy.\n\n<figure>\n  ![A bright green fern, Polypodium vulgare, containing curled fronds, spores beneath its leaves, and a scaley root system](https://www.filepicker.io/api/file/iK4CD1QsQjjhz90oPPWA)\n  <figcaption>\n    <cite>[Otto Wilhelm Thomé](http://biolib.mpipz.mpg.de/thome/band1/tafel_002.html)</cite>\n  </figcaption>\n</figure>"
                }
              ]
            },
            {
              "content": "# Mountain resources",
              "children": [
                {
                  "content": "# Metal\n\nThere's also a bunch of ore used for metalworking.\n\n![](https://www.filepicker.io/api/file/Nq190z5BQISmgluaOIj4)"
                },
                {
                  "content": "# Minerals\n\nThe mountains are rich in minerals. The Fernborn have created much wealth for themselves crafting and trading the minerals extracted from the mountain. They produce some of the rarest metals and gems in the world along with the techniques required to use and shape them.\n\n![](https://www.filepicker.io/api/file/fJ5A25QXTu2X6IRZW6cv)"
                }
              ]
            }
          ]
        },
        {
          "content": "# Lyric's Rivers",
          "children": [
            {
              "content": "# River features",
              "children": [
                {
                  "content": "# Basin\n\nA large drainage basic empties out at a single point into the ocean, creating a massive river delta. Over time, the main river has shifted several times, creating a unique, moving landscape. Its main rivers are well-travelled but human and animal alike.\n\n<figure>\n  ![An extremely large drainage basin that combines the flows of at least four rivers and deposits them at a single spot in the ocean](https://www.filepicker.io/api/file/YBNipmbFRX6TE9SnMu79)\n  <figcaption>\n    <cite>[Dredge Research Collaborative](https://css.lsu.edu/project/sample-project/)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Coast\n\nThe edges and coast of the river delta slowly ebb and flow with every season. It is mostly filled with animals and wet, sedimentary deposits. Movement across this region is slower but the Riverspun have developed techniques to flow through it."
                },
                {
                  "content": "# Wetlands\n\nThe many changes to the river delta's flow has resulted in wetlands of varying properties. Some are fresh, some are brackish, some are drier, some are wetter, some have trees, others have seasonal plants.\n\n<figure>\n  ![A heron and an alligator share the waters of a widespreading mongrove](https://www.filepicker.io/api/file/9OB0k6JGRDWIP6x5HO1E)\n  <figcaption>\n    <cite>[Anderson Design Group](http://andersondesigngroup.com/portfolio-posters.html)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Delta\n\nThe ancient homeland of the Riverspun people is an large river delta. The delta's tributaries (its accumulated river sources) and distributaries (its breaking up into branches) are well mapped and act as established trade routes."
                }
              ]
            },
            {
              "content": "# River fauna\n\nMany aquatic and semi-aquatic species have migratory patterns that include the delta and its basin in their route: salamanders, turtles, fish, frogs, you name it. The plants of the rivers have their insect companions that provide food for larger terrestrial and aquatic predators. Do you like bats? They've got them! Otters and other small aquatic mammals too. Plus other water drinkers like deer and wild cats."
            },
            {
              "content": "# River flora\n\nAll the plants in the river delta love water and move along with it. The trees are highly adapted to sitting in water. Grasses and sedges love water and sand; water lilies love water so much its in their name; carnivorous plants that like water bugs are in for a treat."
            },
            {
              "content": "# Seasons\n\nSeasons have a great effect on the river delta and its water ways. Every summer, when the snow in the mountains starts to melt, rivers run rapid and may overflow in areas. Seasonal drought may prevent movement by boat. Seasons also result in migratory behavior of many animals along the rivers and coast."
            },
            {
              "content": "# River resources\n\n?"
            }
          ]
        },
        {
          "content": "# Haven's Coast"
        }
      ]
    },
    {
      "content": "# Cultures",
      "children": [
        {
          "content": "# Fernborn\n\nThe **Ensloped** and the **Enshrouded**.\n\n- Mountainside cities\n- Terraced estates\n- Lowland hamlets",
          "children": [
            {
              "content": "# Fernborn appearance",
              "children": [
                {
                  "content": "# Capes\n\nOriginated as warmth for foggy temperature drops. Easy to take on and off. Also creates triangular form in body. Over time, capes got wrapped up into status symbols and the elite have really fancy ones.\n\n![](https://www.filepicker.io/api/file/mUdBgleDSFG4M0DZsWU7)"
                },
                {
                  "content": "# Mustaches\n\nOkay yeah, I like mustaches. So too do the Fernborn! They're very in fashion among the men, popularized by many Valley notables.\n\n<figure>\n  ![A handsome man with dark, curly hair and a dashing mustache](https://www.filepicker.io/api/file/E6rKq0RsegWHBmg0Imwj)\n  <figcaption>\n    <cite>[Minttu Hynninen](https://www.deviantart.com/theminttu/art/Dorian-537623273)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Pointed hats\n\nTriangular. Mirror the mountain peaks. Mostly used in formal settings: religious practice, educational system, government work.\n\n![](https://www.filepicker.io/api/file/RX98u4gGRYS0bfHCXXAj)"
                },
                {
                  "content": "# Colorism\n\nI'm iffy on this one. With a history of sun worship and an escape from the sun, darker skin is perhaps revered by the upper class who spend more time in the sun.\n\n![](https://www.filepicker.io/api/file/Wyd2OOdQCO3TObn5gdrA)"
                }
              ]
            },
            {
              "content": "# Fernborn organization",
              "children": [
                {
                  "content": "# Estates\n\nFor as long as the Fernborn have sought escape from the fog, family clans have build grand estates along the valley’s mountainsides. Although many began with terraced agriculture, modern industry has shifted to artisanal craft and trade. Many also serve as private universities. They have amassed great wealth over generations and build their estates with exquisite mansions often adorned with greenhouses and gardens. Many are sites along pilgrimage routes with shrines of common ancestral figures.\n\n<figure>\n  ![A small estate built upon a mountain plateau, cut in half by a flowing river that nourishes its trees and gardens](https://www.filepicker.io/api/file/6MgQaaORTOPjc1Bd09cj)\n  <figcaption>\n    <cite>[Brandon Chang](https://www.artstation.com/artwork/b0JxE)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Universities\n\nIn their quest for technological progress and luxury artisanal craft, estates began inviting and housing master crafts people, scholars, and teachers. Neighboring estates would share these resources and a formal university system was developed in the Valley.\n\n![](https://www.filepicker.io/api/file/Rh4sxfqSRy9PKAEwvli2)"
                },
                {
                  "content": "# Hamlets\n\nIn the foggy mountain valleys, hamlets utilizing dry stone sheltered their inhabitants. Modern technology has upgraded the houses of the lowland valley, but old structures aren't uncommon. Many are repurposed into storage or workshop\n\n![](https://www.filepicker.io/api/file/XimwAdE4QyGA6iD8cqG3)"
                }
              ]
            },
            {
              "content": "# Fernborn craft",
              "children": [
                {
                  "content": "# Perfumery\n\nLike many trades, the Fernborn have mastered the art of perfumery. Perfumes are quite fashionable as modern society attempts cover up natural body scent, often associated with lower-class labor.\n\nModern perfumery builds upon an older tradition of incense which is stilled used in certain religious ceremonies, shrines, and cemeteries. \n\n![](https://www.filepicker.io/api/file/ORQPcrB9QaedD4Cb592z)"
                },
                {
                  "content": "# Mosaics\n\nMosaics and other tiled stonework predate modern trends utilizing glass. Commonly used in bath houses, shrines, entryways, and arts venues. Very period.\n\n![](https://www.filepicker.io/api/file/7fI4dk1YTHuxmXlaFucD)"
                },
                {
                  "content": "# Lamps\n\nLight has always been sacred to the Fernbon. In a mountain valley often covered in fog, light is not always plentiful. The sun is a gift that is never taken for granted.\n\nAs proxies for light, lamps have always been important for the hard-workers in the mountain valley. Open flame become contained. Fuel-burning lanterns became electric. Indeed, modern cities have street lamps illuminated late into the night to allow for longer work days and longer play days.\n\nModern style utilizes delicate glasswork and glass colored by minerals mined from the mountain. The lamps of the Fernborn are coveted around the world.\n\n![](https://www.filepicker.io/api/file/j0Hl4IQiRf6gWaKMbJQv)"
                },
                {
                  "content": "# Statues\n\nGreat stone statues are carved throughout the Valley representing the more ancient and powerful Fernborn. The oldest clans dispute claim over certain ancestral figures. Some statues are remote and comprise a network of pilgrimage sites. Some great statues have been forgotten and abandoned, overgrown in the surrounding forests.\n\nOver time, these larger statues become smaller faces carved in homes and public areas (like grotesques). In cities, ancestral carving has led to a culture of mosaics and stained glass glamorizing more modern heroes and celebrities.\n\n![](https://www.filepicker.io/api/file/AKLNUrtpQy6rBXN2qZvQ)"
                },
                {
                  "content": "# Stonework\n\nIn a mountain range rich in stone, the Fernborn have mastered many stoneworking techniques in art and architecture.\n\nIt’s carved into great ancestral monuments and led to a writing system that originated in stone-carving.\n\nAmong artisans, stones are praised for their unique qualities, including impurities and origins.\n\nModern trends move away from stone into more refined materials such as glass and metal.\n\n![](https://www.filepicker.io/api/file/kqqCL9TRTsOcr8NBEmf0)"
                }
              ]
            },
            {
              "content": "# Fernborn architecture",
              "children": [
                {
                  "content": "# Stained glass\n\nThe Fernborn's love and mastery of glass is nowhere as apparent as in their windows and stained glass. Most stained glass is used in elegant window designs, but recent innovations lean toward the figurative, including family trees and modern celebrities.\n\n![](https://www.filepicker.io/api/file/aOTLfCe5TTyzb21Y8mV8)"
                },
                {
                  "content": "# Towers\n\nOriginally, towers symbolized escape from the fog and reaching toward the sun. In the old days, they were used for yodeling and other far communication to cut through the fog.\n\nModern cities still use towers but their use has changed. Now, they are in police surveillance, in escaping surveillance to discuss secret things, and to boast status.\n\n![](https://www.filepicker.io/api/file/2yiocff2QL6ahtHY8fRI)"
                },
                {
                  "content": "# Pointy buildings\n\nModern city architecture is dominated by pointy roofs and domes.\n\n![](https://www.filepicker.io/api/file/OIC2XvDaSYq9vFZRai4h)"
                },
                {
                  "content": "# Greenhouses\n\nGlass is a common resource for the Fernborn and they've used their mastery of it to create elegant greenhouses. Most greenhouses belong to estates to keep climate-controlled plants, often imported from warmer regions.\n\nThey also produce many of the rare plants used in perfumery and cuisine.\n\n![](https://www.filepicker.io/api/file/apXJPYiRjutdqU57hCVw)"
                },
                {
                  "content": "# Slopes\n\nSettling on the often steep mountainsides of a valley requires ingenuity. The Fernborn use the natural shape of the mountains to their advantage in technology. Terraced farming is pervasive, cave and cliff dwellings are common, and larger cities grow up mountainsides. The upper class use their clearance of fog and proximity to sun as markers of status and entitlement.\n\n![](https://www.filepicker.io/api/file/uwVejKCSaS7kt8nt4k2W)"
                },
                {
                  "content": "# Stairs\n\nHills = stairs\n\n![](https://www.filepicker.io/api/file/7MagAoy5QJKzjcm8OWEl)"
                }
              ]
            },
            {
              "content": "# Fernborn technology",
              "children": [
                {
                  "content": "# Clocks\n\nFernbon cities are pushing common time and using clocktowers and bells to do so. They align train schedules, university terms, artistic performances, and factory labor. Watches are common in the city.\n\n![](https://www.filepicker.io/api/file/nBGMyD9S6NJmCvGBvCTw)"
                },
                {
                  "content": "# Trains\n\nTrains (and cute bridges) are starting to connect the Valley. This has facilitated trade and the sharing of ideas. It also means more mineral extraction and use. In addition to trains, we see funiculars and other lifts.\n\n![](https://www.filepicker.io/api/file/8Xwf7vDRQ1KDvho0o12g)"
                },
                {
                  "content": "# Runes\n\nA people of stone, the writing of the Fernborn is made up of rune-like letters that can be easily chiseled into rock. As the culture modernized to more flexible materials, the angular letters remained and evolved. Their triangular forms are often adapted and incorporated into artifacts and architecture.\n\n![](https://www.filepicker.io/api/file/E70AWh1R4CZoSYZXakPY)"
                },
                {
                  "content": "# Terraces\n\nAs cities grow, they require increasing amount of food. In the mountainous terrain, terraced agriculture has helped the Fernborn grow and sustain larger populations. Other large crops are used for perfumery (e.g. lavender), textiles (e.g. flax), and oil (e.g. rapeseed).\n\n![](https://www.filepicker.io/api/file/fzLZVRYoRVCjkeeojfar)"
                },
                {
                  "content": "# Astronomy\n\n- The sun -> stars in general\n- Obsession with something that doesn't really provide value\n\n![](https://www.filepicker.io/api/file/ycK3mQDST9KZNpFOGcVa)"
                }
              ]
            },
            {
              "content": "# Fernborn performance",
              "children": [
                {
                  "content": "# New Ferborn music\n\n## Melody, soloist\n\n- They're people reaching for the stars\n- The individualism is praised, everyone wants to be a soloist\n\n## Instrumentation\n\n- Probably evolution of former instruments\n- Maybe rhythms can be transformed into \"beats\"\n  - Queues from electronic music?\n  - Wisps used to power machines?\n    - People focus on the melody part so the rhythm pre-determined\n    - They're they're more detached from the act of playing the drone, forget its significance\n- Maybe pitched percussion comes out of non-pitched (e.g. marimbas)\n  - Dreamscapes use droning minimalism like [Steve Reich](https://www.youtube.com/watch?v=RaYvMwQd3cs)\n- Orchestras standardize instruments, allow soloist performance"
                },
                {
                  "content": "# Old Fernborn music\n\n## Drone\n\n- They're people of the earth\n- They hear the slow churn at the center of the earth\n- Rhythm within the drone\n  - Percussive instrument, monotone\n- Drone as echo of ancestors, the persistence of their influence\n- Formal structures give foundation for accompaniment\n\n## Styles and Instrumentation\n\n- Indian ([ektara](https://www.youtube.com/watch?v=pL9kXU7VlmQ))\n- Native American ([drone flute](https://www.youtube.com/watch?v=NRBx5NqysKs&t=651))\n- Aboriginal Australians ([digeridoo](https://www.youtube.com/watch?v=yG9ZX1FS20A))\n- Scandinavian ([taglharpe](https://www.youtube.com/watch?v=muRr8WqrU48))\n- Medieval ([Hurdy-gurdy](https://www.youtube.com/watch?v=bvNZeh6f8vE))"
                }
              ]
            },
            {
              "content": "# Fernborn belief",
              "children": [
                {
                  "content": "# Cemeteries\n\nFor the ancestor-worshiping Fernborn, cemeteries have a long tradition. Their visitation and maintenance were once central parts of spirituality life and family history, but modern times have seen a decline in this practice. Smaller shrines and alters symbolize the abstract ancestor.\n\nTraditional cemeteries use lamps which are said to provide shelter for the soul of the deceased. Keeping the stone lamp clean is important, and bringing and offering of flame/light is the proper honoring.\n\n![](https://www.filepicker.io/api/file/EMm4SlkgRD6oBgAGKvlh)"
                },
                {
                  "content": "# Sun\n\nThere are many theories as to the honoring of light and the sun in Ferborn culture.\n\nOne theory suggests that foggy conditions made the light precious. The sun was celebrated during clear skies and architecture attempted to maximize available light, such as an orientation to the low-angled winter sun (the Valley's clearest season).\n\nAnother theory states that the sun is the original ancestor from which all life derived.\n\nWidespread utilization of lamps and windows are seen as modern effects of more primitive sun worship.\n\n![](https://www.filepicker.io/api/file/kxgWxaiVTrWmFiq5EPPy)"
                },
                {
                  "content": "# Ancestry\n\nThe Fernborn are an ancient people. Lineage, bloodlines, and ancestry play a central role in the lives and organization of Fernborn citizens.\n\nThe ancient fern that fills the mountain valley has been adopted as the symbol for old family lines. It is where their name, the Fernborn, arose.\n\nAncestor worship is central to the spiritual culture of Fernborn. Large stone monuments are carved in the likeness of ancestral heroes. Over time, these monuments have been replaced by a culture of statue and celebrity.\n\n![](https://www.filepicker.io/api/file/uPj2ML2TmyD6OEmOQMlj)"
                }
              ]
            },
            {
              "content": "# Fernborn themes",
              "children": [
                {
                  "content": "# Triangles\n\nTriangles are a common motif among the Fernborn. They represent the mountain and are a metaphor for many hierarchical aspects of society. Triangles are often seen in art, architecture, and apparel.\n\n![](https://www.filepicker.io/api/file/P9rd1QvMRiCXvRx4By46)"
                }
              ]
            }
          ]
        },
        {
          "content": "# Riverspun\n\n\nThe Riverspun are a largely nomadic society whose homeland is in the river delta of a large drainage basin. They have mastered the waters and developed a culture of trade, hard work, and craftsmanship. They have many old customs and traditions to preserve their distributed culture, including the use of masks and tattoos, rejection of modern technology, and storytelling.",
          "children": [
            {
              "content": "# Riverspun appearance",
              "children": [
                {
                  "content": "# Tattoos\n\nPublic tattoos are applied to the chin and the hands and feet to communicate work, legacy, and nature. Private tattoos are applied elsewhere to convey experiences and beliefs.\n\nTattoos mimic the flowing nature of the river. While trading and during ceremony, the Riverspun wear masks. While masked, they use their public tattoos to identify each other.\n\n<figure>\n  ![A hunky dude with dreads, a beard, and tangle of tattoos spreading from his strong jaw to his broad shoulders down his massive arms](https://www.filepicker.io/api/file/LVylefKSemlk3I7wacxg)\n  <figcaption>\n    <cite>[Jainai Jeffries](http://www.fydbac.com/gallery?lightbox=dataItem-jfy8bk8v7)</cite>\n  </figcaption>\n</figure>",
                  "children": [
                    {
                      "content": "# Trimmed or tatted\n\nRobe trim and tattoos use the same (similar) symbol sets.\n\n**Trim**\n  - embroidered\n  - removable\n  - colored\n  - public\n  - signaling\n\n**Tattoo**\n  - \"cursive\"\n  - permanent\n  - limited palette\n  - private\n  - remembering\n\nIf trim is public and tattoos are intimate, your hidden parts (trials?) are what you try to hide from others (or yourself)."
                    }
                  ]
                },
                {
                  "content": "# Braids\n\nUsing their intimate knowledge of fibers, the Riverspun often grow their long and braid it into intricate designs. Despite the heavily gendered society, hairstyles do not differ consistently between genders.\n\n<figure>\n  ![A dark-skinned woman with an impressive array of braids, arranged almost as if she were wearing a royal headpiece](https://www.filepicker.io/api/file/SOP4GT9Qw7xXOYL3IQVQ)\n  <figcaption>\n    <cite>[Sara Golish](https://www.saragolish.com/moondust-collection)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Robes\n\nThe Riverspun flaunt their mastery of cloth in their robes. Robes have a long and important cultural role. They especially aid in signaling and in conformity/anonymity.\n\n<figure>\n  ![Three figures covered head to toe in long and well-crafted robes, revealing only their faces](https://www.filepicker.io/api/file/cjkt5IzoTHmEAhKi2ZBL)\n  <figcaption>\n    <cite>[Phobs](https://phobso.tumblr.com/post/127829193780/demonesses-and-succubus-for-demonslayer-of)</cite>\n  </figcaption>\n</figure>",
                  "children": [
                    {
                      "content": "# Robe periods\n\n**Birth robe**. Growing so much during your younger years, it's used as a wrap. After your first growth spurt (~3) when it's easier to predict your size and shape), it's turned into a childhood cloak. Used throughout adolescence, parents maintain it.\n\n**Fool's robe**. As you start puberty (~10), you get the robe you'll grow into for early adulthood. This is also when you join your first work family, and the material used is often provided by them\n\n**World robe**. After a major achievement in adulthood (most commonly reaching a certain status in a profession), you \"graduate\" from your childhood. This robe is a sign of high status and is better fit and adapted to personal style.\n\nMay have seasonal variations if you have the space or the need."
                    },
                    {
                      "content": "# Under cloak, vest over\n\n- Under cloak: *layered, complex, loose, flowing*\n- Vest over: *flat, straight, blocking, structured*"
                    },
                    {
                      "content": "# Adaptive layering\n\nLiving on the water, the **weather changes** frequently. They need a style that can **adapt to exposure** (sun, heat, rain, cold).\n\nPer season, have three primary cloaks: for **work**, for **worship**, and for **winding** down. Vests **complement** the robes and are interchanged more regularly."
                    },
                    {
                      "content": "# Judgment and maintenance\n\nSince cloaks are kept so long, they must be **maintained** or they soon fall into disrepair. They are made from a **durable** material that takes a while to \"cure.\" It starts out **coarse and rigid** but **softens over time**.\n\nThere's a lot of **judgment** (and signaling) from the **ware and cleanliness** of your robe. Well-worn robes are seen as a sign of **hard work**. Cleanliness and quality of upkeep is seen as a signal of **character**."
                    },
                    {
                      "content": "# Robe reuse\n\nEach robe is **reincorporated** into the next. Shows history. i.e. Family cloth shows parental **lineage**, working cloth shows early **profession**.\n\nThe robes of the deceased are used in **mementos**. Sometimes the robes of the living are gifted to signal favor or **association**."
                    },
                    {
                      "content": "# Trim tales\n\nThe trim of the robe is the most important part. It starts empty and is slowly embroidered over a person's life. \n\n- Major life events\n- Recognition\n- Alliance\n- Membership\n- Identity\n- Skills and ability\n\nUnlike tattoos, embroidering can be undone as life changes.\n\nDon't want too many different kinds of symbols or ones that compete—it becomes harder to others to quickly read."
                    },
                    {
                      "content": "# Formal pleats\n\nFormal culture uses a lot of **pleats**. They are carefully **folded** and require care and maintenance to properly upkeep.\n\nInspiration: saris, hakama"
                    },
                    {
                      "content": "# Tails tied up\n\nTrailing fabric is tied up in several ways to **protect** the cloth or to increase **mobility** during certain activities. Tying is an integral part of outfitting oversized robes in young people. **Harnesses** are commonly used to aid in secure attachment and support."
                    },
                    {
                      "content": "# Misfits\n\nMisfits in society can be literally interpreted. People who don't grow into their robes or outgrow them are often teased or looked down upon.\n\n- Trans folks\n- Overweight people\n- Stunted growth"
                    }
                  ]
                },
                {
                  "content": "# Masks"
                },
                {
                  "content": "# Modernization of tradition\n\nModern nomadic culture loosens much of traditional dress culture. They are generally more **casual** and **borrow style** and material from the places they visit.\n\nTraditions and formality are often maintained in the Delta. Relaxation of formal tradition is seen as an erosion of culture."
                }
              ]
            },
            {
              "content": "# Riverspun organization",
              "children": [
                {
                  "content": "# Guilds\n\n  Many tribes make up the Riverspun across every family profession. They are older and usually tied to blood. Some tribes specialize in niche professions, but most tribes have a range of families that make them up. During congregations in the delta, tribe members across family come together."
                },
                {
                  "content": "# Trade outposts\n\nAlong vital routes, strategic outposts incorporate themselves into existing coastal towns and cities. They **adapt local styles** into permanent stilt structures or build **docks** that anchor houseboats longterm."
                },
                {
                  "content": "# Nomadic sailors\n\nNomadic guilds travel in pods of **houseboats** along seas and waterways in seasonal migrations. Guilds **specialize** their houseboats to the nature of their work. Boats fly numerous **flags** to signal their services. Many houseboats grow **rooftop gardens** and detachable **wagons** to facilitate trade.\n\n*Barn quilts.*"
                },
                {
                  "content": "# Homeland nests\n\nIn more recent times, stationary outposts have rooted in the delta region. The swamps and marshes of the area  **stilted houses**. Larger settlements occur on more solid ground and incorporate **imported materials** and techniques into traditional styles."
                }
              ]
            },
            {
              "content": "# Riverspun craft",
              "children": [
                {
                  "content": "# Rugs"
                },
                {
                  "content": "# Riverspun cuisine\n\n* Seafood\n* Fresh and seasonal\n* Spices\n* Diverse flavors and techniques\n* Balance of traditional and inspired/influenced foods\n"
                },
                {
                  "content": "# Ribbons and knots\n\nAcross their clothing and handiwork interweave distinct ribbons that create intricately beautiful loops and knots.\n\n![The curved top of a boat or a post with its tip carved into a wicked face and intricate knotwork following the downward curve](https://www.filepicker.io/api/file/b0QyTHsIQMSUur0PSe37)"
                }
              ]
            },
            {
              "content": "# Riverspun architecture",
              "children": [
                {
                  "content": "# Boats\n\nHighly specialized boats serve homes, workshops, shops, and transport for the Riverspun. Boats and their professional families are marked with flags. Depending on the work of the family, the boat may be a single ferry, a house boat attached to a gallery boat, a small fleet of canoes. Aesthetic styles of boat vary by tribe.\n\n<figure>\n  ![A large boat, carrying hundreds of people, anchored in the water and adorned with well-designed features for long-term dwelling](https://www.filepicker.io/api/file/cskCncjTRLKw5tOEH9IB)\n  <figcaption>\n    <cite>[Steve Chinhsuan Wang](https://www.deviantart.com/sketchshido/art/Prison-Ship-405795747)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Dams\n\nDamming affects portions of the river delta basin, both created by human and animal. The reservoirs they produce have become an important part of the ecosystem."
                },
                {
                  "content": "# Stilts\n\nThe river is an ever-changing torrent. The Riverspun have adapted their more permanent architecture to account for the flooding of the rivers and coming and going of tides by building their houses on many strong but flexible stilts.\n\n<figure>\n  ![A multi-storied home built over the water that sits upon a hundred thin stilts that bear the weight of the structure yet water flow through with ease](https://www.filepicker.io/api/file/6iJeTRGjQt6MzbH6OepJ)\n  <figcaption>\n    <cite>[Matthew Barrett](https://wiki.guildwars.com/wiki/File:%22Stilt_Village%22_concept_art.jpg)</cite>\n  </figcaption>\n</figure>"
                }
              ]
            },
            {
              "content": "# Riverspun technology",
              "children": [
                {
                  "content": "# Cartography\n\nWhen you travel as much as the Riverspun do, you learn to navigate and map things out pretty quickly. The Riverspun use all the tools available to them: the position of the moon, sun, and stars; landmarks in the local landscape; curves of the river and the paths they make. Although most Riverspun live on the river, many chart out landmasses during their rooted apprenticeships."
                },
                {
                  "content": "# Language\n\nAlthough the Riverspun are known for their many stories and technical craftwork, they lack their own written language, preferring oral tradition with supplementary materials (knots and tapestry, usually). Recently, many have started adopting shared trade languages that have quickly bled into the older spoken language."
                },
                {
                  "content": "# Trade\n\nThe Riverspun see themselves as pollinators and curators of culture. They specialize at early ages and join work families to master trades but learning from and trading for rare and useful tools. Although this could bring them great wealth, they reject money and live simple lives with their modest belongings.\n\n![A clever knot used to secure a bucket to a hook with thick rope, detailed via progressive diagrams](https://www.filepicker.io/api/file/vT006xYrRMyuUJG1kCms)"
                },
                {
                  "content": "# Roof gardens"
                }
              ]
            },
            {
              "content": "# Riverspun performance",
              "children": [
                {
                  "content": "# Song\n\nThroughout their widespread trade routes, the Riverspun have gathered many techniques in arts, design, and engineering. They have adopted a culture of apprenticeship where young citizens spend periods of time on land, working for craftspeople and learning their skills. As a result, they produce fine crafts and many excel in the arts.\n\n<figure>\n  ![A spirited young person with an easy expression holds a large guitar](https://www.filepicker.io/api/file/kKZvvrBASyyuqOL5Ocz3)\n  <figcaption>\n    <cite>[Conner Fawcett](https://www.instagram.com/p/BgUtsZ2ltDg/)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Riverspun music\n\n* Use waterwheels to power instruments (drones)\n* A lot of queues from birds, birdsong\n* Balance of traditional and inspired/influenced instruments"
                },
                {
                  "content": "# Stringed instruments\n\nLike their clothes, the Riverspun have mastery over strings when it comes to instruments.\n\nAt times bowed, at times plucked or strummed, at times hammered. Boats often have built-in instruments.\n\n![](https://www.filepicker.io/api/file/LzK83YTaTVWXt7hCNTaY)\n\nhttps://www.youtube.com/watch?v=iLZQuO_e3Hs"
                },
                {
                  "content": "# Riverspun dance\n\n- Gendered\n- Inspiration from birds\n- Possible inspirations\n  - Contra dance (also gender-free)\n  - Flamenco (maybe better for Fernborn?)"
                }
              ]
            },
            {
              "content": "# Riverspun beliefs",
              "children": [
                {
                  "content": "# Superstition\n\nThe Riverspun are a very traditional people, including in their superstitions. They reject modern technology and magic, yet they incorporate charms, remedies, and divination into their daily lives. Rather than seeing their beliefs as magical, they see themselves as using mystical instruments to observe the world as it is.\n\n<figure>\n  ![A number of lucky charms and mystical objects: a palm reading guide, a wishbone, a horseshoe, the number seven, a four leaf clover, and more](https://www.filepicker.io/api/file/dBOEgxySSNunIgtBTfaW)\n  <figcaption>\n    <cite>[Sophie Ridley](https://www.sophieridley.com/new-page-3)</cite>\n  </figcaption>\n</figure>"
                },
                {
                  "content": "# Signaling as ego reinforcement\n\nThe Riverspun are very concerned with the images they project. Their robes are used for many social functions.\n\nThis perhaps leads to compartmentalization of the personality (public, private, secret), hypercontrol of image, obsession over identity and signaling."
                }
              ]
            },
            {
              "content": "# Riverspun themes",
              "children": [
                {
                  "content": "# Cycles\n\nThe moon and the seasons are central to the Riverspun. The moon follows a short cycle from new to full to new again. The seasons follow a longer one, either moving toward light or toward darkness. They understand the rhythms of plants and animals that move in sync with the world's cycles.\n\nSun as god, night is when god blinks, new moon is when the inner eye blinks. (Sun as the eternal eye, the full moon still sees the sun / is seen by it through a mirror.)"
                },
                {
                  "content": "# Shape: Square\n\n- Cardinal directions\n- 4-season model\n- Moon quarters\n- Symbol for home\n- Also 8 (4+4)"
                }
              ]
            }
          ]
        },
        {
          "content": "# Windtamed"
        }
      ]
    },
    {
      "content": "# Story",
      "children": [
        {
          "content": "# Scenes",
          "children": [
            {
              "content": "There's a fancy party that Gray attends. If Haven is in the same town, they end up being the help for the party / cleaning up / seeing the full price of luxury"
            },
            {
              "content": "Experiencing a hurricane\n\n- Eye of the storm\n- Destruction of shelter\n- Disruption of supply chain"
            },
            {
              "content": "Snail racing"
            }
          ]
        }
      ]
    },
    {
      "content": "# Symbionts",
      "children": [
        {
          "content": "# Fairies\n\n## Inbox\n\nFairies often found in pairs / dual parts that represent a plant and its pollinator (which may be non-insect animals but usually are). Of course, there are many non-plant insects, and many non-insect plants, and non-insect pollinators—are these considered \"fairies\"? The difficulties of categorization + taxonomy"
        }
      ]
    },
    {
      "content": "# Gameplay",
      "children": [
        {
          "content": "# Past scenes\n\nLook into the past! See a scene.\n\n- Gray encountering an overgrown ancestral face carving. Moss grows in crevices around the eyes, in the mouth, out the ears; ferns grow out of those. Sees into the past where it is being maintained: clean and scraped, the area around being gardened and tended to. The stone floor of the shrine has a subtle mosaic pattern and an illuminated stone path leads to the main road."
        },
        {
          "content": "# Materials, sourcing, trade\n\n- Beads\n- Buttons\n- Marbles\n- Shells\n- Patches"
        },
        {
          "content": "# Cooking\n\n- Watch others cook; learn from a teacher\n- More than recipes, learn the reasons that underlie them\n- Tacit knowledge\n- Learn techniques and tools\n- Build upon previous knowledge\n- Adjust with the context\n- Learn lessons through mistakes",
          "children": [
            {
              "content": "# Shakshuka\n\n**Principles**\n\n- This dish is supposed to taste stewy\n  - Cook things slowly, for a long time\n    - High temperatures will caramelize the outsides and leave the insides less cooked\n    - Lower temperatures for a long time will result in more natural sweetness and flavor balance\n    - To do this, cook in a cast iron pan under low heat\n      - Cast iron better distributes heat than other metals\n        - The type/thickness of metal evens itself out smoothly\n    - It helps to cover the pan at various points\n      - Covering prevents moisture loss and conserves heat\n      - It contains the steam which makes sure the tops are cooked too\n- Taste as you go\n  - Experience the transformation of the dish\n- You can make in large quantities without much extra effort\n\n**History**\n\n- Originated NW Africa / Magrhreb\n  - Dated to Ottoman North Africa in the mid-16th century\n  - Tomatoes introduced by Cortés during Columbian exchange (exchange of goods between Americas and Afro-Eurasia)\n    - Columbian exchange killed 80–95% of the Indigenous peoples starting in the 15th century\n  - Mediterranean had access to far-off ingredients\n- Variations exist across the world\n  - Jewish culture: large batch of tomato stew made for Sabbath and used for shakshuka the next morning\n  - Italian dish, uova in purgatorio: tomato paste, anchovy, garlic, parsley, parmesan\n  - Andalusan (S Spain) dish, huevos a la flamenca: chorizo and serrano ham\n- Eaten at various points during the day: breakfast, lunch, dinner\n\n**Prepare**\n\n- Bring the pan to temperature first with plenty of olive oil\n  - Oil adds flavor and helps the first ingredients begin their cooking process\n- Cut up your stuff early\n  - This makes sure you don't try to multitask, e.g. letting your oil get too hot while you're chopping or forget an ingredient in your rush\n- Chill out\n- This dish takes a while but doesn't require your full attention\n  - You'll smell things\n  - You gotta remember to stir it occasionally, so don't do something too involved or removed from the pan\n- Since it's so slow, you can clean as you go\n\n**Cook the foundation**\n\n- Start with onions and peppers\n  - Onion is an important flavor enhancer (it's in a family called aromatics)\n  - Peppers add sweetness and their own flavor that complements the tomato\n  - Cook first so they get soft\n    - The acidity of the tomatoes slows down the cooking of other vegetables\n    - The high water content of tomatoes also affects cooking time\n  - You could add the garlic and spices here or later\n- Add tomatoes after onions + peppers are cooked enough\n  - You can add a bit of water if you want to leave it cooking for longer and do something like work on your video game\n- The longer it cooks, the deeper and more complex the flavors\n- As it reduces, make sure it has enough water so it doesn't burn on the pan\n\n**Spices the dish**\n\n- Strong spices give a lot of character to the base dish, they add flavor, aroma, and personality\n  - Certain flavors and blends also give cultural flavor profiles\n- Not required, so you can omit them for a more neutral dish or one that you want to use for multiple purpose\n- I'm putting in garlic with the spices, but a lot of people add them with the aromatics (like onion) \n- There are lots of spices you can use\n  - Cumin, paprika, and cayenne are traditional\n  - Coriander and caraway also common\n  - You could use red pepper or gochugaru (Korean ground chili)\n- For spices, you can toast them whole or ground\n  - Grinding them before or after allows them to blend in with the stew\n    - Ground spices lose their flavor more quickly, especially when stored long term\n    - If they're ground before toasting, they'll burn quicker\n    - You probably won't grind them if cooking them with other ingredients\n  - Leaving them whole look nice, add subtle texture, and give small bursts of flavor\n- You can toast spices in the oven (not sure about the garlic)\n- You can cook with oil in a pan\n  - You can do this after the first round of onion/pepper\n    - Make a well in the middle and heat them there\n  - You can do this after reducing the tomatoes\n    - Same concept but there's more water to interfere\n  - You could do this at the beginning, but they'll maybe burn\n    - The onions and peppers don't have a lot of moisture immediately so they might not cool down enough and continue to cook\n  - You can cook it in a separate pan for more control\n  - You can add liquid to immediately lower the temperature (like tomatoes)\n  - Don't leave the stove, it'll be quick, like a minute\n  - You can add the spices to cold oil so that they heat up more slowly\n- Spices are done when they become very fragrant and start to brown\n  - They're really easy to burn, be careful!\n\n\n**Embellishments and adjustments**\n\n- Do last taste tests and adjustments\n- After you add the eggs, it'll be harder to mix around and distribute\n- The dish should be pretty balanced: acidity from the tomatoes, sweetness from the slow-cooked pepper and onion, a savory quality from the slow-cooked tomatoes\n- Adjust salt, knowing that it might not need a lot more since it's already so savory\n  - You could even under salt it, knowing you'll add a finishing salt while serving\n- Adjust spices or spiciness\n  - Black pepper is familiar, cayenne is traditional, you could use chili flakes\n  - Tunisia adds harissa\n  - Don't worry about toasting them if you're already at the end\n- You could add meats\n  - Maybe you serve it with a sausage at the end\n  - Maybe you grind up the meat, like sausage, chorizo, or lamb\n  - Consider what kind of texture they'll contribute\n- You could add potatoes and/or beans for more heft and a creamy firm texture\n\n**Serve**\n\n- Poach the eggs\n  - There's a lot of water content so it evens the heat and prevents the eggs from cooking to quickly or coagulating (getting bright yellow and getting hard instead of being thick and smooth)\n  - The faster you poach, the more chance you'll over or undercook the eggs\n  - If you do it slow and steady, the yolk gets very gooey\n  - Set a timer for these, you really don't want to forget, and they won't have any smell clues\n    - Eggs cook pretty predictable, figure out your ideal egg time (for me it's like 5 or 6m)\n    - Lean toward undercooking them than overcooking them (depending on personal preference, ofc)\n  - Cover: steaming cooks the yolks from all directions\n  - Do this at the end so they don't sit around and continue to cook or cool\n- If it needs more salt, a large-grain salt will contribute crunchiness\n- Could add some fresh herbs for garnish\n  - They add color and bursts of fresh flavor\n  - Parsley is nice\n    - Softer herb: not too strong but distinct\n    - Bright green color contrasts the red/orange of the stew and white/yellow of the eggs\n  - If you've got an herb garden, use something fresh!\n- Could add some creaminess\n  - Soft cheese (like feta or salty sheep's milk) adds creaminess and saltiness\n  - Yogurt adds tartness and creaminess\n- Could serve with bread: pita, baguette, sourdough fried in olive oil\n  - If you don't want or have a fork, bread can be used as a utensil\n- Could accompany with mint tea\n- Could serve alongside pickled vegetables\n  - Add a sour element, crispy freshness, fiber and nutrients\n  - Can be preserved at their peak and used later when tomatoes are in season\n- Could serve alongside preserved lemon for a complex sweetness/sourness\n- Could add olives or artichoke hearts or sardines or whatever\n"
            }
          ]
        }
      ]
    },
    {
      "content": "# Development",
      "children": [
        {
          "content": "# Task requests and rewards\n\nWork bounty system: Tasks that are more valuable, difficult, urgent are given higher rewards. Who decides what's valuable, difficult, urgent? Everyone? Do the people who create the tasks give them their rewards? You can earn \"dollars\" by doing tasks and them spend them to create compelling tasks? Could your base \"salary\" depend on your role? Can this be collaborative?"
        },
        {
          "content": "# Defining data sources\n\n## Example: Unicode viewer\n\nI want a tool to search for and explore unicode characters and emoji. I've been using random websites online, but I haven't found one that does just what I want. I'll keep looking for better ones, but of course I can't help about building my own one day that has all of features I want:\n\n- Technical explanations *in context*\n- A way to view and navigate blocks\n- View different eomji sets\n- Robust fuzzy searching, browsing, discovery\n- Local first\n\nI imagine I'll have to start by writing my own models of unicode. Simultaneously, I'll want to start building a UI that can eventually represent those models (and do interesting things with them).\n\nOnce I have the machinery built, I need the data that will flow through it. Where do I get all of unicode characters and their descriptions? Where can I get emoji sets (Google, Apple, Twitter) and are they copyrighted?\n\nI imagined writing a little scraper. Let's say it can go to [`unicode.org`](https://unicode.org/emoji/charts/full-emoji-list.html) and download a bunch of data locally.\n\nIn order to stay up-to-date, we can summon a daemon to watch that website for updates and re-run the script to sync the data to the new standard. In some ways, this source becomes a well from which we draw from. Maybe the well fails one day or we find a better one. We just need to find a new source, update our scraper, and continue mirroring the data on our own machines.\n\nPS: While searching for a good source, I ran across a really cool video by the Unicode Consortium, \"[Race is Not a Skin Tone. Gender is Not a Haircut](https://www.youtube.com/watch?v=kaucJce8hhE).\" Imagine how cool it would be to have a link to this available while exploring skin-toned emoji."
        },
        {
          "content": "# Browser as IDE / input device\n\n*Building upon Firefix via its extension API*\n\n* Use the browser to:\n  * Render local files\n  * Browse the world-wide-web\n  * Control tools and UIs\n\n\n* A browser like Firefox allows us to extend functionality via:\n  * Bookmarks + bookmarklets\n  * Toolbars\n  * Extensions\n  * Plugins\n\nThe important artifact is the independent data I collect and how it's defined, organized, and stored\n  * The browser plugs into me, not the other way around\n  * Other things may one day plug into the same system\n  * Multiple browsers even, if they access/modify the same data",
          "children": [
            {
              "content": "# Incorporating webpages\n\n**Make a copy**\n\n- Scrape (makes a local copy of the site)\n- Transform (automatically extracts the good stuff)\n- Confirm (quickly review and edit by human)\n\n**Make a citation**\n\n- Create an entry/citation\n- Link the source, timestamp, and copy\n\n**Add metadata**\n\n- Add to a collection\n  - To read\n  - Date(s) read\n  - Examples\n  - Source material\n  - Domain\n\n**Pull quotation**\n\n* Highlight quotation\n* Automatically generate citation with link\n\n**Exporting**\n\n* Transform into flat list of bookmarks for browsers\n* Transform into UI to link to local files (`file:///`)"
            },
            {
              "content": "# Search tools\n\nA little window used for a specific purpose. To use, you must first make a { **connection**, **transformer**, **plugin**, **joint**, **bridge** } that meets or fits into the { **interface**, **slot** }\n\n* Encyclopedia\n  * [Wikpedia](https://en.wikipedia.org/)\n* Dictionary\n  * [Webster's 1913](https://www.websters1913.com/)\n    * \"[How *Merriam-Webster’s Dictionary* defined American cultural beliefs](https://www.bookforum.com/culture/how-merriam-webster-s-dictionary-defined-american-cultural-beliefs-24536)\"\n  * \"[You’re probably using the wrong dictionary](http://jsomers.net/blog/dictionary)\"\n  * [The Kenkyusha Dictionary of English Collocations](https://www.goodreads.com/book/show/46271541-the-kenkyusha-dictionary-of-english-collocations)\n* Thesaurus\n  * [Roget's 1911](http://www.roget.org/)\n* Metaphors\n  * [MetaNet Metaphor Wiki](https://metaphor.icsi.berkeley.edu/pub/en/index.php/MetaNet_Metaphor_Wiki)\n* Etymology\n  * [Online Etymology Dictionary](https://www.etymonline.com/)\n* Books\n  * [Goodreads](https://www.goodreads.com/)\n* Math\n  * [Wolfram|Alpha](https://www.wolframalpha.com/)\n* Web documentoion\n  * [MDN](https://developer.mozilla.org/en-US/)\n* General (cesspit)\n  * [Google](https://www.google.com/)\n  * [DDG](https://duckduckgo.com/)\n* Visual discovery?\n  * [Pinterest](https://www.pinterest.com/)\n* Unicode\n  * [Unicode Character Table](https://unicode-table.com/en/)"
            }
          ]
        },
        {
          "content": "# Declarative scene tool\n\n- say what you want\n- another tool gives drafts/proposals\n- automate transitions, coordinate events\n\n> A hard conversation in a beautiful setting. The calm, picturesque view is meant to contrast the gravity of the dialog. Quiet space with natural sounds, overlooking the city. Sunset: golden but short-lived, moving to darkness."
        },
        {
          "content": "# Spreadsheet tool\n\n\"How would you represent it in a spreadsheet?\" (From [A Systemic Approach to Systemic Design](https://www.youtube.com/watch?v=HR8EmTyJz9A))\n\nNo matter how complex, data should eventually be representable in a \"spreadsheet.\" Could I make a tool that helps view and modify data that uses the lens of a \"spreadsheet?\" (Manual structured data manipulator.)\n\nA small spreadhsheet to represent some data. A window. Instead of having several tabs, a set of data is its own spreadhseet"
        },
        {
          "content": "# Communication system\n\nIs it possible to combine IMs, emails, message boards, documentation, etc into a single model of virtual communication? (I guess this could also include general notes / arbitrary data)\n\n- Banter with co-workers\n- Discussions on feature \n- Question asking & support\n- Documentation of key discussion/decisions\n\n\n- Archived vs ephemeral\n- Personal, shared (group), public\n- Specific to general\n\n\n- IMs: Instant, temporary, ongoing, top-of-mind\n- Emails: More formal, longer, composed\n- Message boards: Hierarchical, topic-oriented, long-term\n\nImagine something starting as a 1-to-1 chat, the relevant bit split out and exposed to a group (\"team\") chat, then that conversation resulting in some decision which is documented alongside its discussion"
        },
        {
          "content": "# Problem-focused language\n\n> [...] macros are definitely evidence of techniques that go beyond glue programming. For example, solving problems by first writing a **language for problems of that type**, and then writing your specific application in it.\n\nhttp://paulgraham.com/weird.html"
        },
        {
          "content": "# Flattened graphs\n\nWorking on Herbert's website, I noticed that the site is like a graph. There are a bunch of inter-related nodes and we provide a few ways to navigate between them.\n\nThe primary navigation gives links to the top-level nodes of one hierarchical categorization. The secondary navigation gives a linear path through the graph.\n\nIn theory, you could attempt to make a linear / circular traversal through a graph that touched every node. You could have several of these paths!"
        },
        {
          "content": "# Building a language\n\n- Internal system of meaning + logic + mathematical relationships\n- Can translate to English (code and interfaces)\n- Could translate into other languages too\n- Underlying language is self-contained / abstract\n- What are the \"words\" and their origins/metaphors?"
        },
        {
          "content": "# Growing a project\n\n- Programming as theory building\n- Collecting a lot of little pieces and then assembling them\n- Codebase as a house\n- Trees growing together in a forest"
        },
        {
          "content": "# Metaphors and system diagramming\n\n- Each element is represented as a concrete name/image\n- \"Look under the hood\" reveals the code (model, process) encapsulated by the thing\n- Many rich metaphors to draw from (names + images)!\n- A chunk of code is a blackbox with an API, should be able to interchange \"gears\" within the boxes\n- Shapes suggest affordances, use, metaphor\n\n[Metaphors in man pages](https://jvns.ca/blog/2020/05/08/metaphors-in-man-pages/)",
          "children": [
            {
              "content": "# Reference, curation, reminder\n\n- Bookmark\n- Dog ear\n- Piton\n- Sticky note\n- Anchor\n- String around your finger\n- Pointer\n- Favorites\n- Mnemonic"
            },
            {
              "content": "# Subcomponents\n\n- Organ\n- Tissue\n- Cell\n- Organelle\n- Gear\n- Machine"
            }
          ]
        },
        {
          "content": "# Committing changes\n\n- Working on a shared repo, artifact\n  - Data\n  - Documentation\n  - Development\n  - Description\n- Commits are append only\n  - Data is append only? Data are commits?\n    - Code is data",
          "children": [
            {
              "content": "# Idea solidity\n\nHow do I specify exploratory ideas vs committed ones? Can I establish a spectrum of how developed or certain an idea is? Are there classes of ideas, like \"in progress,\" \"definitely want,\" \"lightly held\"? Could I use tags?"
            },
            {
              "content": "# Local first, publish the good stuff\n\n- Local first\n- You always have a copy\n- Automatically saves local commits (\"saves\")\n- Periodically squash (manually and/or automatically) into more meaningful units (rebase)\n- Don't have to worry about screwing stuff up\n- You can share and collaborate on branches with others\n- Experiment with forks"
            },
            {
              "content": "# Commit messages\n\n- Commit messages could have a lot of generated data, some for people, some for machine\n  - Metadata\n  - Organizational data\n  - Visualization data\n- Maybe a human can provide a message but not every commit needs one"
            }
          ]
        },
        {
          "content": "# Ad hoc code\n\nI've been really enjoying writing on-the-fly code snippets (mostly HTML + CSS) while composing nodes. Imagine if you could do this with all kinds of code (like scripts and stuff).\n\nIt would be cool if it could also limit scope and ensure code safety / sandboxedness (when desired)."
        },
        {
          "content": "# Training employees\n\nAfter watching the documentation lecture, I got to thinking about the ways in which we teach new employees and introduce them to a project. I thought about me wanting to join a Closure shop but not having the experience (or desire to learn on my own).\n\nWhat experience actually matters? What can be trained?\n\nExperience maybe matters for project strategizing and navigation. I feel like we should teach capable employees the tools they need to contribute rather than expect them to already have the skill and then realize that no one helped them transform what they knew into the new language/process."
        },
        {
          "content": "# Earliest ideas, deepest roots\n\nEarly ideas, the seeds that have had the longest to grow and change and interact with other things. Like an old-growth forest. Sometimes they die and become food for others.\n\n- Me, you, we\n- Triangle, square, hexagon"
        },
        {
          "content": "# Word clusters\n\nSome ideas start out as clusters of words / concepts until I can better understand the thing that they all share or that connects them"
        },
        {
          "content": "# Ocean of thoughts\n\nI imagine putting all my thoughts into an unorganized vat. That's the sea of my thoughts! I can then take all the drops of water and organize/structure them however I'd like. I could see it as a dataset through which to run organizational functions + subdivisions + views."
        },
        {
          "content": "# Dream studio\n\n- Sustenance\n  - Kitchen\n  - Maintenance (cleaning + repair)\n  - Stewardship\n- Goods\n  - Carving\n  - Bookbinding\n  - Jewelry making\n  - Apparel\n  - Metalworking\n  - Electronics\n  - Printing\n  - Furniture making\n  - Pottery\n- Sourcing\n  - Junkyard\n  - Garden\n  - Library\n- Materials\n  - Weaving\n  - Papermaking\n  - Pigments\n\nWe bring in teachers, and we teach each other, and we practice and experiment together. We're encouraged to explore and iterate on our ideas in the physical world.\n\nWe use computers to help us record and organize knowledge, create new tools to help us with our projects, and orchestrate our work. As a bonus, we get food, clothing, skills, and we can sell our things for extra money."
        }
      ]
    },
    {
      "content": "# Aesthetics"
    },
    {
      "content": "# Threads",
      "children": [
        {
          "content": "# Primitive operations\n\n- Subdivision"
        },
        {
          "content": "# Me, you, we\n\n- Me → you → we\n  - Start with the self (me)\n  - Acknowledge the other (you)\n  - Combine with the other (we)",
          "children": [
            {
              "content": "# Pronoun: Me\n\n- Start with one\n- Start with the self\n- A foundation to build upon\n- An origin point\n\n\n- Individualism\n- Singularity, pinnacle\n- Importance on origin"
            }
          ]
        },
        {
          "content": "# Curses\n\n## Trinity\n\n- Gray: Blood, inheritance\n- Lyric: Beauty, image\n- Haven: Bonds, independence\n\n## Healing\n\nSince healing is another major component of the game, curses are perhaps one of the things that can be healed and integrated.",
          "children": [
            {
              "content": "# Kinds of curses\n\n- **Original sin** and **inheritance**\n  - Blemishes passed on by ancestors\n- **Lessons**\n  - e.g. *Holes* or *Beauty and the Beast*\n  - Punishment for a wrongdoing that can be redeemed\n- **Cursed objects**\n  - e.g. shrunken head or haunted houses\n  - Objects possessed by malevolent forces\n- **Reincarnation**\n  - A repeating cycle that may one day be broken\n- **Manifestation**\n  - e.g. Negative things you believe, self-fulfilling prophecies\n  - Making true the things you think or believe\n- **Zero sum** like the Cursed Ring from Final *Fantasy*: Price paid for something gained, positive and negative balanced\n- **Deals with the devil**\n  - Something gained but with a sinister twist or catch\n- **Life**\n  - I didn't ask to be born\n- **Knowledge**\n  - Information that cannot be unlearned\n- **Broken oaths**\n  - Misery brought upon by a breach of contract\n- **Bad luck**\n  - e.g breaking a mirror\n  - Superstitious belief bringing misfortune\n- **Trauma**\n  - Involuntary reaction echoing from past events\n- **Personality traits**\n  - e.g. perfectionism\n  - Positive gifts that has a dark sides\n- **Reputation**\n  - e.g. Image, identity\n  - A self-imposed standard to uphold\n- **Fate**\n  - A destiny you cannot change, forces outside your control"
            }
          ]
        },
        {
          "content": "# Time\n\nTime was original conceived as Gray's power, but I think it's going to be important for all the characters and all the cultures.\n\nEach of the cultures is introduced in the present but we learn more of their histories as the story progresses. We can only look as far back (and forward) as our vision is wide.",
          "children": [
            {
              "content": "# Past, present, future\n\n- Fernborn: Sprinting toward the **future**\n- Riverspun: Shifting with the **present**\n- Windtamed: Erased of their **past**\n- Empire: Time flows backwards, we see from **past**"
            },
            {
              "content": "# Time magic\n\n* Past\n  * Development (e.g. chain of events up to present)\n  * History (e.g. see ruin before its collapse)\n  * Forgotten (e.g. old trail)\n* Present\n  * Broadening (e.g. propagating waves of action)\n  * Context (e.g. simultaneous factors)\n* Future\n  * Planning (e.g. pruning a tree)\n  * Envisioning (e.g. focusing a mission)\n  * Preparing (e.g. planning reaction to trigger)\n  * Consequence (e.g. predicting reactions)"
            },
            {
              "content": "# Cultural time paradigms\n\n**Fernborn**\n\n*Resource, finite, precise*\n\nTime is a more literal resource for Gray. Activities in their day are scheduled; content is authored and organized within the framework of that structure.\n\n**Riverspun**\n\n*Cycling, flowing, springy*\n\n**Windtamed**\n\n*Borrowed, gifted from God*\n\nThe Church believes that time is the future falling backward toward us. Time flows backward instead of forward. Everything has already happened and we’re catching up to it. Everything is destined and God has seen the entire course of time. (Alan read something like this at Cafe International about the Augustinians.)",
              "children": [
                {
                  "content": "# Time and Food\n\n## Gray / Fernborn\n\nMealtime for Gray reveals the \"time as commodity\" thinking of the Fernborn. Food is prepared by a separate kitchen staff. Meals are relatively short and adhere to a regular schedule. They are polite and convenient. Snacks are restaurants also common.\n\n*Formal dinners, etiquette, gourmet cooking, convenience, packaging*\n\n## Lyric / Riverspun\n\nMealtime for the Riverspun is a deep part of the culture and conveys the \"ever flowing into itself\" perspective of time. Meals are long and shared. Something is always stewing for the next meal, leftovers often incorporated into the next. Meals provide a common foundation for many other social functions. Part of bodily rhythms, health, and balance.\n\n*_An Everlasting Meal_, siestas, potlucks, shared meals*\n\n## Haven / Windtamed\n\nMealtime for Haven is common among the Windtamed and articulates their belief that \"time is loaned.\" Their cooking follows many conservative rules and focuses on the nourishing aspect of food. It is part of a busy life and so is kept simple, important but not elevated.\n\n*Kosher, temple food, Ayurveda, temperance/gluttony*"
                }
              ]
            }
          ]
        },
        {
          "content": "# Climate change\n\nClimate change is acutely felt by the Riverspun. The climates they travel have been changing rapidly and are becoming increasingly erratic and hard to predict or navigate. It is causing hardship for the Riverspun, making traveling riskier and more dangerous. Perhaps this is why more people are settling in Delta (and elsewhere)."
        }
      ]
    },
    {
      "content": "# Research"
    },
    {
      "content": "<div class=\"section\">Workspace</div>"
    },
    {
      "content": "# Uncategorized inbox",
      "children": [
        {
          "content": "# Narrative continuity, reverse foreshadowing, destiny\n\nIf we limit direct agency during certain \"cinematic\" moments (conversations, interactions), then we'd be able to play with time / characters interacting across time.\n\nThere's an interesting element with destiny/prophecy. If you build your character one way in the present moment, when you go back in time, it moves in the direction of your choice so you see it in its infancy. (e.g. If you choose the path of botany, when you go back in time, you'll encounter memories that involved plants/botany; they show the background / lead up / significance of your choice.)"
        },
        {
          "content": "# Onomancy + name signaling\n\n- Names in game are nouns\n- In some cultures, certain names are taboo/off-limits\n- Big concepts like Beauty, Memory, Hope are seen as bold\n  - Reserved for upper class / \"people destined to do great things\"\n- Imagine a conversation where someone lower class has one of these bold names and the rich kids are making fun of them (they're \"trying to look fancier than they are\"). As a rebuttable: \"You'd wish you had a name like mine. The greatest mystery you'll ever ponder in your life is why vines choke other plants to reach the sun\" (if their name is Morning Glory)"
        },
        {
          "content": "# Dream interpretation & astrology\n\n- Pop astrology\n- Dream interpretation (for Gray)\n  - But then the dreams get weirder it becomes clear that they're special"
        },
        {
          "content": "# Brooms\n\n- Broom, broom making\n- Cleaning / chores system\n- For Haven, but also\n- Should every system interact with all characters?"
        },
        {
          "content": "springs, fishing, tension, future, dreams\np: high priestess, hierophant, temperance, two of swords, page of cups"
        },
        {
          "content": "# Visuals\n\n## Sets\n\n![](https://www.filepicker.io/api/file/JZEq1Y5oQ22g8VMyVxWL)\n\n(Paper / pop-up book collab?)\n\n- Pull tabs, opportunities to interact\n  - Maybe even help add details to set to help seed it\n- Filters over lights\n- Zoom in, refocus\n- Shift angle, force perspective\n- Play with lighting\n- Shifts in time, place\n- Adjustments to represent internal state\n\n## Inspo\n\n- Kentucky Route Zero\n- French Dispatch\n- Spider-Man: Into the Spider-Verse"
        },
        {
          "content": "# The Coups",
          "children": [
            {
              "content": "**coup de foudre** | ˌko͞o də ˈfo͞od(rə) |\nnoun (plural coups de foudre pronounced same)\n\n*a **sudden unforeseen event**, in particular an instance of love at first sight.*\n\nORIGIN\nFrench, literally ‘stroke of lightning’."
            },
            {
              "content": "**coup de grâce** | ˌko͞o də ˈɡräs |\nnoun (plural coups de grâce pronounced same)\n\n*a **final blow or shot given to kill a wounded person or animal**: he administered the coup de grâce with a knife.*\n\n*an action or event that serves as the culmination of a bad or deteriorating situation: the epidemic has been the coup de grâce for the airline crisis.*\n\nORIGIN\nFrench, literally ‘stroke of grace’."
            },
            {
              "content": "**coup de main** | ˌko͞o də ˈman |\nnoun (plural coups de main pronounced same)\n\n*a **sudden surprise attack**, especially one made by an army during war.*\n\nORIGIN\nFrench, literally ‘stroke of hand’."
            },
            {
              "content": "**coup de maître** | ˌko͞o də ˈmet(rə) | noun (plural coups de maître pronounced same)\n\n*a **masterstroke** (\"an outstandingly skillful and opportune act; a very clever move.\").*\n\nORIGIN\nFrench, literally 'stroke of master'"
            },
            {
              "content": "**coup de théâtre** | ˌko͞o də tāˈät(rə) |\nnoun (plural coups de théâtre pronounced same)\n\n*a **sensational or dramatically sudden action or turn of events**, especially in a play.*\n\nORIGIN\nFrench, literally ‘blow of theater’."
            },
            {
              "content": "*coup d'état* | ˌko͞o dāˈtä |\nnoun (plural coups d'état | ˌko͞o dā ˈtä(z) | )\n\n*another term for coup, \"a **sudden, violent, and illegal seizure of power from a government**: 'he was overthrown in an army coup.'\"*\n\nORIGIN\nFrench, literally ‘blow of state’."
            }
          ]
        },
        {
          "content": "Remembering\nMemories\nStories\nNarratives\nStructures\nOrganization\nOrdering\nKnowledge\nLearning"
        }
      ]
    },
    {
      "content": "# Tasks & Prioritization\n\n1. Complete cultural details with pictures (moths, glass, braids, etc)"
    },
    {
      "content": "<div class=\"section\">Character & Plot</div>\n\nThe main characters and the story they’re involved in"
    },
    {
      "content": "# Gray\n\n<span class=\"coin gray\"></span>",
      "children": [
        {
          "content": "# Medium: Dreams & Visions\n\n* Reveries\n* Nightmares\n* Daydreams\n* Lucid dreams\n* Visions\n* Hallucinations\n* Trances\n* Wishes\n\nMaybe the different kinds of dreams provide different time abilities.\n\nDo most dreams happen at night? Could introduce an interest dynamic.\n\nMagic dreams could be triggered by the use of perfume"
        },
        {
          "content": "# Dreams and Visions\n\n- Fernborn are headed to a world of automata; people are cogs in a grand machine (society, the economy)\n  - Follow their fate / destiny / roles\n- Dreams (and the queers who have them) help break out of this abusive structure\n- Dreams as creating new futures instead of persisting the harmful ones we're heading toward\n- Easy to get lost in the fantasy\n - There's a limit to an individual's control (influence, ability, access)\n- Fernborn: Schools of magic found mechanical ways to program Wisps (it's kind of cruel, like forced labor)\n  - Gray is the more natural way: you inspire the Wisp to fulfill the vision\n    - Gift from Sage\n    - Starts out simple when young\n      - Training exercises, tools, guided examples\n    - Much more complex and imprecise when older\n      - Harder to say what's purely right/wrong, good/bad, success/failure\n to help you solve the real problems); grows more complex with age\n  - It's messy and unexpected but is humane and full of surprise; takes time, has mistakes along the way\n  - School way is very precise, algorithmic, simple, overly abstracted, optimized,",
          "children": [
            {
              "content": "# Visions\n\n*gift*\n\n- Future vision (see what will happen)\n- Past vision (see what was in the past)\n- Widening vision (broader propagation of change)"
            },
            {
              "content": "# Dreams\n\n*medium*\n\n- Part One\n  - Pull intention out of dream, code into Wisp\n- Sequel\n  - Apply Haven's knowledge to inspire and recruit all kinds of symbionts\n  - Manifest dream visions\n  - Realize your problems lay with humans\n    - Must apply leadership to society, can't rely on dream magic"
            }
          ]
        },
        {
          "content": "# Gray Summary <small>(outdated)</small>\n\nGray is the eldest of the chord. Their culture, the Fernborn, was founded on ancestor worship and lineage (symbolized by the fern) and has developed wealthy cities in a mountain valley. Their struggles center around choice, agency, and understanding the self (\"me\"). For these reasons, they embody the Enneagram triad ruled by intuition, anger, and the gut.\n\nTo explore Gray's themes of choice and individual power, their powers center around time manipulation. Which of our actions can be reversed and which ones cannot? Furthermore, in a society that is deeply rooted in heritage but is headed toward celebrities of the moment, Gray's time magic enables them to tap into a past (both good and bad) that is being simplified and forgotten. They use the power to learn more about the costs of the privileges they inherit and question what they can do to right old wrongs.\n\nGray occupies a few different spaces. They grew up in a wealthy family in a valley estate. For much of their early life, they were isolated from the costs of their privileged life. As they mature, they descent the mountain and spend more time in the fog and eventually into the caves. Around the same time, they start having vivid dreams that slowly start bleeding in with real life. They run into a group of magical dreamers and learn more about how their time magic is manifested in their dreams. Much of their time is spent in the dream world.\n\nBecause of their family obsession with reputation and status, Gray was very restricted as a child. They were told what to learn and how to learn it with high expectations for success and prestige. They attend the university to study an application of magic. Their parents' strictness cause them to repress their anger, and they fall into addiction while coping with their stress. They are involved with the upper class of the valley and deal with abstract problems of the city.\n\nThe expression of their queerness feels to Gray like an act of rebellion. However, because of their parents focus on reputation, they must be kept private. Their romances are kept secret, experienced quickly in interstitial spaces. Gray likes to push this line with their family and carries a confident attitude, flirting easily.\n\nAs they mature, Gray must test their family's love by living openly as their true self and as an individual, risking dishonor or disownment. To fulfill their potential, Gray must work to learn who they are and what they are willing to sacrifice for individual change. In doing so, they must unlearn the skewed reality they were fed as a child and understand what is normal for themselves.",
          "children": [
            {
              "content": "![](https://www.filepicker.io/api/file/xrmGHUyESs2f824OYEbW)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/7nC5CpgMRsaHkzw3qjQC)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/BPqaloTSTgedhzb35ToH)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/3j81CIlRraobRERbgE0w)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/k3R3KxRL2xRWtla9UYQz)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/Zlc6HsPhRjWdMkds40hm)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/NRmloCyNTazN6tiGv0gB)"
            }
          ]
        }
      ]
    },
    {
      "content": "# Lyric\n\n<span class=\"coin lyric\"></span>",
      "children": [
        {
          "content": "# Power: Perception & Knowledge\n\nLyric has access to a lot of interesting interfaces and perspectives that are unavailable to others. They have access a lot of hidden places.\n\n* Synesthesia (visualize smell and sound)\n* Orthogonality (perceive other planes)\n* Categorization (see groupings and differences)\n* Mirroring (display what you see)\n* Masquerade (adjust what you display to others)"
        },
        {
          "content": "# Medium: Records & Collections\n\n* Collecting (e.g. sea shell collection)\n* Bartering (e.g. rare spice for ink of equal value)\n* Catalogs (e.g. birds of local area)\n* Maps (e.g. pathways through forest)\n* Sound recordings (e.g. street musician songs)\n* Pictures (e.g. portrait of landscape)",
          "children": [
            {
              "content": "# Collection\n\n- Maps encourage some kinds of collection\n- Collecting materials\n- Sets and collections\n- Trophies\n- Data collection?\n- Also concerned with taxonomies? Judgments and \n- **Questions**"
            }
          ]
        },
        {
          "content": "# Gender and sexuality\n\n- Gender roles are a cultural value\n  - More so in Delta than on River\n- Family units are around work families, not sexual partners\n  - Same-sex relationships not common but not seen negatively (within gender norms)\n- Crossing genders is mostly frowned upon\n  - More so in Delta than River\n- There exists a rarer kind of third gender\n  - Accepted in Delta, often seen as lucky\n  - Opposite to what you'd expect\n  - more stigma along River when influenced by other cultures with strong binaries\n  - Often a little witchy\n    - Give cures and spells to otherwise superstitious culture\n    - Connection to symbionts\n- Can't decide if Lyric's grandparents are strict or chill about gender issues\n  - Would probably be chill, but Lyric preemptively tries to please/adjust\n\nInspiration:\n\n- [Muxe](https://en.wikipedia.org/wiki/Muxe)\n- Two spirit"
        },
        {
          "content": "# Image and expectation\n\n- Lyric cares a lot about their image and\n- Aware of the expectations put on them from many angles\n  - Put in a lot of effort to meet all expectations\n  - Compensation for being in the closet?\n- Optimizes for looking good / keeping up appearances\n  - Lessons and tools along the way but ultimately harmful"
        },
        {
          "content": "# Lyric themes\n\n- you\n- shifting\n- rivers\n- lens\n- perspective\n\n\n- Curses, superstitious\n- Conservative folk value racial purity\n  - i.e. Bigger deal in Delta than on River (source of bullying)\n  - Seen as \"diluting\" (or even giving away) the inherent power of race\n- Oaths?\n  - Breaking oaths brings curses\n  - Explains importance of marriage\n  - Is it too close to Haven's contracts?\n  - Fairies have a lot of pacts\n- Work families\n- Accessibility\n",
          "children": [
            {
              "content": "# Perception & Appearances\n\n*gift*\n\n- Perceive slices of the world\n- Slices can relate to mapmaking in culture?\n- Umwelt: Different classes of organisms perceive different (compose-able) layers\n- Sometimes leads to over-stimulation or sensory overload\n- Suffers from using all of the data they gather to adjust self + image\n  - Used to fuel obsession over image\n\nInspiration:\n\nUmwelt",
              "children": [
                {
                  "content": "# Umwelt\n\nFrom the [Wikipedia article](https://en.wikipedia.org/wiki/Umwelt):\n\n* > Umwelt is the \"biological foundations that lie at the very epicenter of the study of both communication and signification in the human [and non-human] animal.\" The term is usually translated as \"self-centered world.\"\n* > Each functional component of an umwelt has a meaning and so represents the organism's model of the world. These functional components correspond approximately to perceptual features...\n* > It is also the semiotic world of the organism, including all the meaningful aspects of the world for any particular organism, i.e. it can be water, food, shelter, potential threats, or points of reference for navigation.\n* > An organism creates and reshapes its own umwelt when it interacts with the world.\n* > As a term, umwelt also unites all the semiotic processes of an organism into a whole. Internally, an organism is the sum of its parts operating in functional circles and, to survive, all the parts must work cooperatively."
                }
              ]
            },
            {
              "content": "# Maps\n\n*medium*\n\n- Learn what can and cannot be mapped\n- Mapping puts curses upon the concepts it represents (e.g. bias)\n  - Maps inherit the curses (e.g. prejudice) of their makers\n- Mapping"
            }
          ]
        },
        {
          "content": "# Pronoun: You\n\n* You is the other: the second person\n* As you see others, they see you\n\n\n* Mirrors\n* Duality\n* Opposites\n* Perception\n\n\n* \"You\" in songs. Personification, metaphor, symbolism"
        },
        {
          "content": "# Lyric summary <small>(Outdated)</small>\n\nLyric is the middle of the chord, always caught between things. They are a member of the nomadic traders and artisans, the Riverspun. Their culture holds a paradox: they are highly traditional but constantly change and adapt to the conditions of seasonal life on the river.\n\nLyric's struggles center around the boxes they put themselves in and the expectations they feel from others. In other words, they care too much about what \"you\" think, and they change themselves to fit that image. They claim the Enneagram triad ruled by feelings, shame, and the heart.\n\nTo explore Lyric's themes of tradition and adaptation, they encounter the power of reorientation. Physical orientation is an important theme for their nomadic culture, but metaphorical orientation will be important theme in Lyric's journey to maturity. In order to understand themselves and the power their ego has in the world, they must learn to see as others do, develop connections, and practice humility.\n\nSpeaking of humility, Lyric excels at pretty much everything they do. They are the golden child, learning quickly and following instructions without question. They obsess over the opinions of others, and they expend their energy attempting perfection. In their early years, Lyric falls into cliche roles in social groups, often choosing work to avoid the work of socializing. As they mature, they learn to make mistakes, express their personal creativity, and push against labels.\n\nThe traditions of the Riverspun apply pressure in many parts of life: gender roles, tribes and families, sexual rites, interactions with outsiders. Because of this, Lyric spends their childhood repressing their sexuality and live in denial, in the closet. After the pressure becomes too much, Lyric leaves their family and wanders around the land, independently working for hire. On this journey, they come out to themselves and unlock their power. To fulfill their potential, they must love fully and openly, showing their culture that traditions can change as much as the rivers.",
          "children": [
            {
              "content": "![](https://www.filepicker.io/api/file/D5P9yJjiTke2CVkaPnKv)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/LGu2nBATTq3iZ24Tohac)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/7Os74qtS8yZTZDytTjtY)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/TYgghjeqQRSaBV6mpg6C)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/ynAvaW9QEgtuNZhqRdAx)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/nXsyQxq4q1o9d7x9wSpO)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/lQ1AzUsWRPCukbZwBmeu)"
            }
          ]
        },
        {
          "content": "- Beauty\n- Flirt\n- Heartbreaker"
        }
      ]
    },
    {
      "content": "# Haven\n\n<span class=\"coin haven\"></span>",
      "children": [
        {
          "content": "# Power: Contracts & Favors\n\nThis is definitely the most symbiont-oriented power of the trinity. It's basically asking for symbionts to cast spells for you. There are a lot of kinds of spells and a lot of ways to cast them. At higher levels, you can compose them to do more complex and specific (or general) things.\n\n- Lead (to a destination)\n- Translate (a foreign language)\n- Decipher (a secret code)\n- Heal (a wound)\n- Activate (an artifact)\n- Power (a device)\n- Protect (from impact)\n- Ignite (a fuel source)\n\nWhen composed:\n- Ignite + Dampen: Warm"
        },
        {
          "content": "# Medium: Art & Craft\n\n* **Songs** (e.g. flattering ode as lure for audience with powerful creature)\n* **Food** (e.g. healing soup as a bath for healing spirits)\n* **Sigils** (e.g. formal contracts for protection)\n* **Weaving** (e.g. new home in scarf for rain-fearing spirit)\n* **Braiding** (e.g. maze for a concealing spirit)\n\nI hope to have a lot of these. It gives me the opportunity to explore a bunch of domains. I probably won't be able to go super deeply into any one of them.\n\nMaybe I should create these mechanics and make them available to the world. Haven's power would be that certain mechanics correspond to certain spells.\n\n* Can craft inks for Lyric\n* Can craft perfume for Gray"
        },
        {
          "content": "# Assembling Instructions\n\n- \"Fate\" or \"destiny\" as fancy words for it\n- Goal of dream is to obtain a \"set of instructions\" to give to an automaton\n- Go into the labyrinth and back out\n- Find/create instructions by exploring the dream\n  - Could this be like programming?\n- Dreams include time manipulation as tools to help craft vision\n- Dream is contained in, programmed into, assigned to Wisps\n- Wisps (carrying a fate) would be implanted into appropriate machinery\n- BFG as source material\n- Is Gray just enacting the fate given by the Sage? How is that different from the fate placed by society?"
        },
        {
          "content": "# Haven summary <small>(Outdated)</small>\n\nHaven is the youngest of the chord. They grow up on the Windtamed archipelago, recently colonized by a religious empire after the wind vanished from the islands. They, and their culture, explore the joining of separate things (\"we\"). Those things may clash, they may exchange, they may help, and they may grow. They express the Enneagram ruled by thinking, fear, and the mind.\n\nIn their youth, Haven appreciated a loving family life. They were surrounded by siblings and the church community, working hard to remain faithful to their family and to God. However, the religion forbade queer relationships, believing that it attracted pagan spirits. While attending a religious camp for youth, Haven develops feeling for another kid. They build a relationship that is maintained via letters (the other kid lives on another island). Unknown to Haven, their love interest lives in a village bordering the old forests where many queers find refuge. The proximity to the spirits cause them to travel with the letters and affiliate with Haven. Their parents notice the wild influence and discover the letters and their child's secret.\n\nLike the wind from the islands, Haven's parents abandon them. Threatened with severe and damaging treatments to remove the spirits and their queer influence, Haven runs away and looks for their lover's home. Without the experience or support, Haven falls into trouble and turns back to the church for aid. They enter a religious order, offering submission, and enter a life of asceticism.\n\nYears later, Haven happens upon their old lover. Unrecognizable, Haven is passed over, rekindling fears of abandonment and isolation. They decide to run away again, this time into the forests by following their childhood friend. This leads them to the forest where queer communes are hidden from\n\nEventually, Haven leaves the islands that symbolize isolation. They face their fears by moving into the city where they are surrounded by hostility and religious retribution. Here, they find their chosen family, human and spirit alike.\n\nHaven reaches their potential by learning to find connection with everyone. It requires much work and practice to forgive and take the noble. For years, they expend themselves trying to provide service for others before realizing that they never learned to ask for help themselves.\n\nDuring their time in the religious order, their power was granted through submission to God. However, as they grow, they learn that true power is found in union. They use their spirit mark to create bonds and contracts with spirits, trading favors and making deals. They learn to love themselves and others again, focusing their energy toward build true community.\n",
          "children": [
            {
              "content": "![](https://www.filepicker.io/api/file/PgNoylY2QQCUQE95XwQc)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/d1N9pU8PRQWqC7t6Fh1F)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/WNvSqkviTIiHfRW8NedM)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/INQX7c8pTWm6e811C9QV)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/6sjmHqV3S7WnLhdQywEh)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/mx0d4wJMSmmo9IWJctdl)"
            },
            {
              "content": "![](https://www.filepicker.io/api/file/AS6Dm13BR0m1V7dh6iBq)"
            }
          ]
        }
      ]
    },
    {
      "content": "# Plot",
      "children": [
        {
          "content": "# Plot points\n\nSpecific ideas?!",
          "children": [
            {
              "content": "# Gray's older sib addiction\n\nMaybe Gray's older sib has a drug addiction. Didn't die from an overdose or infection but their behavior became affected and it steered them into a destructive lifestyle."
            }
          ]
        },
        {
          "content": "# Events",
          "children": [
            {
              "content": "# Straight crushes\n\nIs this an event?"
            },
            {
              "content": "# First time dancing at a gay club\n\nSo magical. Never knew there could be a place like this. Overwhelming. Drunk. Freedom in movement, safety in attraction."
            },
            {
              "content": "# Worlds Fair\n\n- Opportunity to get all of the characters to come together\n- Possibly hosted by Fernborn"
            }
          ]
        },
        {
          "content": "# Places\n\n* The Glass Orerry\n* The Moss Gardens\n* The Lamp Shop\n* Trash Mountain"
        }
      ]
    },
    {
      "content": "<div class=\"section\">World & Culture</div>\n\nThe world inhabited by the characters and its history"
    },
    {
      "content": "# Windtamed\n\n* Archipelago\n* Mainland empire\n\n<span class=\"coin haven\"></span>",
      "children": [
        {
          "content": "# Windtamed overview\n\nThe Windtamed are the indigenous people of a recently colonized archipelago. Historically, a shield of high wind and sharp rocks protected the archipelago its surrounding waters. After the wind's ominous disappearance, the mainland empire arrived with religious missionaries and colonists. Over time, the islands were modernized and deforested, sharing their newly acquired agriculture and timber with their landlocked neighbors.",
          "children": [
            {
              "content": "# Archipelago\n\nThe archipelago inhabited by the Windtamed is a set of islands located in a bay (formerly) protected by high winds and sharp rocks. It is home to many endangered species of moths and butterflies, birds, and salt-tolerant plants.\n\n<figure>\n  ![A hamlet on a group of nearby islands sits above a dark ocean; the sky above mirrors the water's brooding mood](https://www.filepicker.io/api/file/0AuuGt8XSkyGdU6sKDEs)\n  <figcaption>\n    <cite>[Yvan Duque](https://yvanduque.tumblr.com/post/91442310825)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Coves\n\nThe islands are home to a number of hidden coves which contain unique plants and creatures and are often used for temporary refuge and smuggling in modern days.\n\n<figure>\n  ![The entrance to a cove hidden among tight rocks](https://www.filepicker.io/api/file/mgPXbb3kQmOm0uVBoxBI)\n  <figcaption>\n    <cite>[Leslie White](http://www.trailheadstudios.com/index.html)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Empire\n\nAccording to published history, after the wind's abandonment, a religious empire sent aid to the archipelago and help them modernize and walk the stable path of God rather than follow the fickle and selfish spirits. Could it have been them that killed the wind to open up the bay for trade? Of course not! Did they spread campaigns to replace the fertile forests of the islands with farms to feed the empire? Ludicrous!\n\n<figure>\n  ![Massive areas of land converted into urban centers creating oceans between the forests once covering the landscape](https://www.filepicker.io/api/file/WBtmjwTJRGuvI9eL0P0O)\n  <figcaption>\n    <cite>[Stefano Boeri Architetti](https://www.stefanoboeriarchitetti.net/en/project/tirana-030-2/)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Moths\n\nThe archipelago have a large number of endemic species, as islands often have. Here, moths make up a large number of these species, unable to cross the large bodies of water.\n\n<figure>\n  ![Three spectacular moths with distinct eye-like markings on their wings: one of orange, one of brown, and one of blue](https://www.filepicker.io/api/file/cHm5AP23Sje4QDggdq5c)\n  <figcaption>\n    <cite>[Scott Partridge](https://www.jevaart.com/artworkprints.htm)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Families\n\nFamily has always been important for the Windtamed. Although the soil of the archipelago is fertile, the Windtamed kept their agriculture small, working alongside the entities of nature instead of overpowering them. Between food farmed and foraged, resources were scant but not scarce. Population numbers remained steady and families consisted of three adults and three children with many shared responsibilities. When the empire arrived, they preached that homosexuality was apart from God's Path: the ideal family was a wife, husband, and many kids to work the fields and find others to walk along the Path. Now, large families are encouraged to produce labor for the growing farms."
            },
            {
              "content": "# Farming\n\nMassive clearcutting of the island was done to produce rich farmland with high yields. Who was all the food for? Certainly not the residents of the island, their faith promotes asceticism.\n\n<figure>\n  ![A small cluster of houses surrounded by sloped hills filled with ripening fruit on perfectly manicured vines](https://www.filepicker.io/api/file/PvHvKrYSQfmRLF3BKK4j)\n  <figcaption>\n    <cite>[Pierre-Abraham Rochat](http://www.parochat.ch/le_guillon)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Fauna\n\nThe archipelago is known for its migratory animals, especially turtles and crabs, moths and butterflies, and birds. Like many island groups, the physical separation of species has resulted in highly diverse and specialized species. In addition to birds and insects, the island is also home to a number of small mammals.\n\n<figure>\n  ![Above the water's surface, the landlocked cannot sea the vastness below their city: a world clams and starfish among forests of kelp](https://www.filepicker.io/api/file/UVIZswVuTPqnZtVwwMAb)\n  <figcaption>\n    <cite>[Alice Pattullo](https://www.alicepattullo.com/)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Flora\n\nThe native plants of the islands are tolerant of high winds and little fresh water. Around the shores are salt-tolerant plants including a large number of colorful succulents. Old growth forests contain a species of giant tree that can withstand the high winds they evolved in: their wood is strong yet flexible. Many specialized fungus species also exist, enabling the trees and understory plants to communicate."
            },
            {
              "content": "# Forests\n\nThe forests that remain are a cultural taboo. In recent years, deforestation has slowed and the remaining forests are protected, their inhabitants left alone. It is said that all the spirits and the queers fled to the forests where they still reside, attempting to keep out of sight when they interact with the world outside the forests. Over the years, some villages and sects of the church began growing along their borders, allowing interaction with the forest dwellers. Even so, it is widely believed that they are surrounded by the spirits of the forest, their curse infectious to those they spend time around. The architecture of many forest homes uses the living plants shaped over time. Even so, these forests are filled with ruins of old villages.\n\n<figure>\n  ![Large houses with smooth plaster walls built around a tree and supported by its trunk and branches](https://www.filepicker.io/api/file/gtip4rxPTke5G5AZWmkK)\n  <figcaption>\n    <cite>[Ziggy Zhu](https://www.artstation.com/artwork/A99Z3m)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Lighthouses\n\nWith the disappearance of the wind, foreign boats could sail through the waters if they were familiar with the rocky bay. A number of lighthouses positioned on the islands double as sources of light for travellers caught in the dark and as religious temples for the island citizens.\n\n<figure>\n  ![In a rocky sea, glowing pillars act as lighthouses on dangerous rocks and cities alike](https://www.filepicker.io/api/file/AXTVtJZSbqkOcVqOVrPK)\n  <figcaption>\n    <cite>[Linnea Sterte](https://www.inprnt.com/gallery/turndecassette/alqualonde/)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Ocean\n\nBeyond the bay containing the archipelago, the vast ocean has inspired much lore of the Windtamed. The high winds and frequent storms dissuaded them from exploring the vast ocean, as their boats were more suited for short travel between islands and to the mainland. Without wind, the empire has developed new ships that open a high-traffic trade route buffered by the islands."
            },
            {
              "content": "# Paper\n\nSince high winds would blow it away, paper was historically reserved for things specifically intended to fly. Now, paper used mostly for things that can't fly (since there's no wind): bookmaking, origami, and fine art."
            },
            {
              "content": "# Port\n\nGod teaches us that from every tragedy is born a new hope for the future. Although the winds blew away and never returned, it enabled the steady ocean to carry new ideas and wonders through the bay. Without the organizational efforts of the mainlanders, the islands would have never succeeded as lighthouse-filled ports on their own. What a waste that would have been.\n\n<figure>\n  ![Many ships bobble atop the waves below a new and prosperous city, enjoying a unique position along an important trade route](https://www.filepicker.io/api/file/q5D3XiIYRtOxmhOKa5vZ)\n  <figcaption>\n    <cite>[Edmund Dulac](https://www.gutenberg.org/ebooks/51432)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Race\n\nLiving under the shade of their forests, the Windtamed are light skinned with almond eyes and peach-stained cheeks (like in Siberia). After the arrival of the empire and the upheaval of the primitive family structure (God is the third parent, not some gay person), marriage became a way for natives to ensure wealth for their family and status within the church.\n\n<figure>\n  ![A fair-skinned girl with almond-shaped eyes stands in the shadow of trees; she is adorned in brightly patterned winter clothes](https://www.filepicker.io/api/file/WWRp4VqfQOb4wEa3zoYg)\n  <figcaption>\n    <cite>[@pomodorosa](https://pomodorosa.tumblr.com/post/137013777597/fresh-snow)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Religion\n\nThe religion spread by the mainlanders preaches that the wind abandoned the islanders and their way of life. The god of the empire guided them to sail to the archipelago and aid their endangered inhabitants. The Windtamed were taught by missionaries that the spirits of nature that they worshipped were dangerous and selfish. Their God played no tricks; He is loving and cares for all who walk alongside Him. With the forests cleared and the wind vanished, few encountered spirits of nature. The ones that did venture near humans were often angry and struggling to survive, making them easy targets for the church to decry."
            },
            {
              "content": "# Style\n\nThe old art style made use of solid color blocks with heavy lines and much metaphorical imagery. The empire introduced the islands to painting and realism and today, the styles have mixed. They wear many hats to keep their fair skin out of the sun. They are also know for their bright colors, once from the their extensive knowledge of forest plants, now imported. Winters are more harsh without the forest protection, so clothing utilizes fur and wool.\n\n<figure>\n  ![A figure of a well-dressed woman in a style characterized by its ivory hue atop flat colors outlined in dark and clean lines](https://www.filepicker.io/api/file/Z9VDDroYSXeODy0ssDXV)\n  <figcaption>\n    <cite>[Ivan Bilibin](https://www.wikiart.org/en/ivan-bilibin/vologda-girl-in-holiday-dress-1905)</cite>\n  </figcaption>\n</figure>"
            },
            {
              "content": "# Syllabary\n\nThe language of the Windtamed is syllabary with an emphasis on composition into increasingly complex/abstract terms and their corresponding symbols. Writing was originally carved into wood and based on the hexagon. Since the arrival of the mainlanders, a variant of the imperial alphabet is used to write out the syllables onto paper with ink pens."
            },
            {
              "content": "# Wind\n\nThe Windtamed get their name from a long history influenced by the high winds surrounding the archipelago. The wind granted the archipelago protection: no one but the Windtamed could navigate the sharp rocks to travel in or out of the bay the islands inhabit. The winds were rejoiced. They powered windmills, enabled kite flying, enlivened instruments. But one day the winds began to slow and eventually stopped. Shortly after, the nearby mainland empire showed up in their boats and promised to help the Windtamed learn to thrive in their new conditions, offering technology and protection."
            }
          ]
        },
        {
          "content": "# Windtamed: Costume\n\nStyle is achieved through color combination, proportion, cut\n\n* Simple\n* Clean\n* Geometric\n* Layered\n\n**Colonial**\n\n* Peasant\n* Neutral colors\n* Unadorned\n* Can work in\n\n**Imperial**\n\n* Gilded: representative of God\n  * Maybe white is peasant alternative"
        },
        {
          "content": "# Windtamed architecture\n\nBrick and shorelines.",
          "children": [
            {
              "content": "# Holy city\n\nImperial architecture uses **elaborate brickwork** from bricks using local clay. The bricks represent order, cooperation, and steadfastness. **Circles**, representing divine unity, are commonly used in arches and decorative features, especially in the city's **cathedrals**. The nearby river feeds the city's **canals** and helps maintain traditional **walled gardens** of the elite.\n\n*Persian gardens. Venetian canals. Romanesque.*",
              "children": [
                {
                  "content": "![](https://www.filepicker.io/api/file/IYu3xLKaT5KpTesmS2Ee)"
                },
                {
                  "content": "![](https://www.filepicker.io/api/file/pf3T9U5SMKh4MqlgeHFn)"
                }
              ]
            },
            {
              "content": "# Metropolitan outskirts\n\nAlthough the city center is wealthy and highly adorned, the outskirts of the Empire are **dense** and use **low grade brick and plaster**. Buildings, many of them multi-tenant **apartments**, are tightly packed, allowing little light to reach poorly maintained **alleys**.",
              "children": [
                {
                  "content": "![](https://www.filepicker.io/api/file/P8Hnc86SQrSn7Zp9tumv)"
                }
              ]
            },
            {
              "content": "# Imperial outposts\n\nImperial power in the archipelago is concentrated in **port cities** and settlements that **dominate high ground**. Many of the forts are held within **circular walls**. Traditional architecture is influenced by the, resulting in a blend of **brick and wood**\n\n*Hakka walled village.*"
            },
            {
              "content": "# Modern archipelago\n\nOn the modern archipelago, **farms and villages** build using **brick foundations** that represent the support of the Empire. Beside the foundation, most other buildings are simple, making use of **local wood** and traditional techniques. In the country side, intricate wooden **churches** mark many vistas. Many abandoned **windmills** mark the Empire's early conquest, whose style often matches the still-functional **lighthouses**.\n\n*Stave churches.*",
              "children": [
                {
                  "content": "![](https://www.filepicker.io/api/file/TGOfEMDQ2ikhlsY4fcgV)"
                },
                {
                  "content": "![](https://www.filepicker.io/api/file/rHYhq5yZTxe7HACuwXvX)"
                },
                {
                  "content": "![](https://www.filepicker.io/api/file/96zwVeZRQYanoWwTK2w8)"
                }
              ]
            },
            {
              "content": "# Ancient forests\n\nAncient Windtamed homes were simple, built with **wood and cloth**. The islands' dense forests held many **sacred places** that often featured **living structures**, slowly shaped over generations out of trees and other plants. Six is a lucky number, and **hexagons** are found throughout architectural elements.\n\n*Banyan trees.*",
              "children": [
                {
                  "content": "![](https://www.filepicker.io/api/file/19ZaHg0TTd26h1kAPTFP)"
                }
              ]
            }
          ]
        },
        {
          "content": "# Windtamed cuisine\n\n## After conquest\n\nIslands are primarily agricultural producers for the mainland Empire.\n\n* Imperial\n  * Restrictive\n  * Kosher, Hillal\n* Islands\n  * Simple, almost ritual in quality\n  * Steak and potatoes, temple food\n\n## Before conquest\n\n* Communal gardens\n* Forest stewardship\n* Foraging\n* Vegetarian"
        },
        {
          "content": "# Types of islands\n\n- Islands that are accessible during low tide\n- Agricultural islands\n- Spiritual islands\n- Pirate, smuggling islands\n- Wild/haunted islands\n- Imperial islands\n- Trade islands"
        },
        {
          "content": "# Shape: Hexagon/Circle\n\n- Holy\n- Hexagon into circle\n  - circle is more perfect; reaches divinity\n  - formerly seen as hubris\n- Reverence for the circular moon?\n"
        },
        {
          "content": "# Stories to hide tragedy\n\n- Windtamed (Skytamed?)\n- Tamed: submission\n- Story of islands is sad and real\n- The wind spirit wasn't actually killed\n- Myths are given to certain elements of society and its history\n\nLike, imagine an introduction to the archipelago. It's being told to (or by) a child: a bedtime story about the wind spirit that forsook the island's people. What actually happened was that climate change weakened the islands and then they were conquered."
        }
      ]
    },
    {
      "content": "# Symbionts",
      "children": [
        {
          "content": "# Original taxonomy\n\nThe symbionts have strange and mystical properties that can make them difficult to classify. Even so, since symbiotic and mortal life often run in parallel (AASB), a common taxonomy describes the symbiots relating to the major kingdoms of moral life. Other groups (like the religious empire) propose their own descriptions (angels and devils).",
          "children": [
            {
              "content": "# Sages\n\n*humans*\n\nWise and mysterious, see great patterns, influence rather than enact, most human-like"
            },
            {
              "content": "# Dragons\n\n*animals*\n\nGreat beasts, protect the other symbionts, highly adapted to their environment"
            },
            {
              "content": "# Fairies\n\n*plants and insects*\n\nTerritorial, cyclic and adaptive, tricky to avoid putting in effort, mostly silent, a lot of pacts/agreements"
            },
            {
              "content": "# Goblins\n\n*fungi*\n\nKind of funny, reuse discarded and unused things, live in colonies and share info, many underground\n\n* Musical themes: Found objects (bottles, pots), often percussive"
            },
            {
              "content": "# Shades\n\n*microbes*\n\nSmall, often in groups, live in cracks, pretty much everywhere, may infect / take over things"
            },
            {
              "content": "# Wisps\n\n*electricity*\n\nDon't have much will, animate the inanimate, perform specific tasks and goals\n\n* Musical themes: Synths and electronic music"
            }
          ]
        },
        {
          "content": "# The Ledge\n\n```\n              The Ledge\n                  |\n                 \\+/\n                / . \\\nHumans -----[ The Peace ]------ Sages\n                  |\nAnimals ----[ The Grace ]---- Dragons\n                  |\nPlants -----[ The Swift ]---- Fairies\n                  |\nFungi ------[  The Wit  ]---- Goblins\n                  |\nMicrobes ---[ The Voice ]----- Shades\n                  |\nComputers --| The Spark ]------ Wisps\n                 /|\\\n              \\---^---/\n                / * \\\n                 /|\\\n                  :\n```\n\nThe line between magical and non-magical life is often referred to as \"The Ledge,\" referencing the edge of something like a cube. They represent sides of the same object but exist orthogonality. When the edge is viewed directly, both faces are visible, but when viewed at an angle, only one side is visible.\n\nMany people refer to magic as a gift that was given to the kingdoms or an event to happened to each: Peace, Grace, Swift, Wit, Voice, Spark."
        },
        {
          "content": "# Source of magic\n\nAll magic in the world comes from symbionts. Humans have a long history of power exchange, but recent technology has resulted in new ways of accessing symbionts, often creating disturbance and disequilibrium."
        },
        {
          "content": "# Gardeners of the world\n\nAs suggested by their name, symbionts have a deeply interconnected relationship with the natural world. They have evolved alongside mortal life, influencing creatures as well as landscape and weather. They act as gardeners, letting the diverse beauty of the world shine, encouraging growth and change, and maintaining health and balance."
        },
        {
          "content": "# Many names\n\n- Symbionts\n- Symbiotes\n- Spirits\n- Demons\n- Angels\n- Helpers\n- Gardeners"
        },
        {
          "content": "# Gray, Lyric, Haven\n\nEach character gives us a different way to engage with the symbiotic world. Many of the problems they are solving relate to symbionts, but they ultimately learn that the bigger problems (for both worlds) lies in affecting change among humans."
        },
        {
          "content": "# Queerness in the symbiotic realm\n\nQueerness is widespread in the symbiotic realm. Many humans who walk within it tend to be queer themselves (AASB). They tend to understand the world better and have a deeper connection to it."
        },
        {
          "content": "# As above, so below\n\nThere are many parallels and equivalences between the symbiotic and mortal worlds. Movements that happen in one often trigger mirrored events in the other."
        },
        {
          "content": "# Legendary creature inspiration\n\n[Wikipedia article, List of legendary creatures](https://en.wikipedia.org/wiki/List_of_legendary_creatures_by_type)\n\n* **Animals** (e.g. bats, hyenas, rabbits, boars)\n* **Artificial** (e.g. golem, automaton)\n* **Body parts** (e.g. eye, hair, mouth)\n* **Concepts** (e.g. death, luck, dreams, time)\n* **Demons** (e.g. Christian, Japanese, Hindu)\n* **Elements** (e.g. air, earth, gold, light)\n* **Habitats** (e.g. caves, savanna, volcano, house)\n* **Humanoids** (e.g. human-skinned, monstrous, temporary)\n* **Hybrids** (e.g. chimera, griffin, selkie, minotaur)\n* **Astronomical** (e.g. sun, moon, constellations)\n* **World** (e.g. world tree, world turtle, world elephant)\n* **Plants** (e.g. dryad, mandrake, spriggan)\n* **Shapeshifters** (e.g. wendigo, lamia, changeling)\n* **Time** of day (e.g. werewolf, vampire)\n* **Undead** (e.g. banshee, poltergeist, draugr, zombie)"
        },
        {
          "content": "# Physical/mystical symbiosis\n\nSages require a symbiotic relationship with humans. The Trinity are all people who have all paired with a Sage, which is why they have powers. They are also guided by the Sages and are sometimes seen as \"cursed\" with a destiny.\n\nPerhaps all symbionts require a physical counterpart to enact their will, fulfill their needs, protect themselves."
        }
      ]
    },
    {
      "content": "# Setting",
      "children": [
        {
          "content": "# World History",
          "children": [
            {
              "content": "# Natural History\n\n* Mostly the same as Earth\n  * Plants and animals\n  * Moon and night sky\n  * Geology and biomes\n* Some major shifts (to make it just unfamiliar enough)\n  * Sea level\n  * Desertification\n  * Tectonic plates + fault lines\n  * Mountain ranges\n  * River systems\n  * Hot spots\n  * Ocean and air currents\n\nInspiration:\n\n* [Earth in Steven Universe](https://steven-universe.fandom.com/wiki/Earth)"
            },
            {
              "content": "# Human History\n\n* Many parallels but few (no) exact matches\n* Must be sensitive + respectful w.r.t race and culture\n* Unsure how much history is shared (if any)\n* Want a \"modern\" feel\n  * Problems are relevant\n  * Clothing is familiar\n  * Technology is recognizable\n\nInspiration:\n\n* Cassandra Jean\n* Spirited Away\n* Mutazione\n* Steven Universe"
            }
          ]
        },
        {
          "content": "# Scenography\n\nWhat's a good book, course, introduction to this?\n\n- https://en.wikipedia.org/wiki/Scenography\n- http://www.dialogueforcommunity.com/2017/06/a-toolkit-of-theatrical-devices/",
          "children": [
            {
              "content": "# Light\n\nTheatrical lens: Chiaroscuro\n\nScenes illuminated by a point light\n\nGeorges de La Tour:  He painted mostly religious chiaroscuro scenes lit by candlelight"
            }
          ]
        },
        {
          "content": "# Overarching story structure\n\n- Magical realism but in an alternate world\n- Alludes to our world but is different\n- Magical elements in the world usually relate to symbionts\n- Magic is often presented as a theatrical lens"
        }
      ]
    },
    {
      "content": "<div class=\"section\">Themes & Theory</div>\n\nThemes in the game and deeper theories about the game"
    },
    {
      "content": "# Themes\n\nAnd sayings?\n- It's never too late\n- Cresting the hill\n- Not better/worse, just different\n- And, not but\n- Follow the pain, lean into the discomfort",
      "children": [
        {
          "content": "# Perfectionism\n\nNothing here yet but it's a personal theme and Gray will also explore it. Does it go here or with Gray?"
        },
        {
          "content": "# Change\n\n<blockquote title=\"Parable of the Sower by Octavia Butler\" cite=\"https://www.goodreads.com/quotes/5732-all-that-you-touch-you-change-all-that-you-change\">\nAll that you touch\nYou Change.\n\nAll that you Change\nChanges you.\n\nThe only lasting truth\nis Change.\n\nGod\nis Change.\n</blockquote>\n\n- In the game, it's literal\n- As you define things, you define yourself\n- Lessons unlock new perspectives\n- Coping mechanisms become tools\n- Exposure reinforces norms\n- What you interact with becomes the focus\n- You are what you eat\n- Out of sight, out of mind",
          "children": [
            {
              "content": "# Cultural shift: old and new\n\n- What if every piece had a new and old component?\n- Like the cultural derivative instead of just point\n- Better see the movement between time\n- \"God is Change\""
            }
          ]
        },
        {
          "content": "# Addiction\n\n* Drugs\n* Success\n* Gambling\n* Porn\n* Entertainment\n* Videogames\n* Work\n* News\n* Social media\n* Food\n\nWhat is addiction? How do people become addicted?\n\nFrom the [Wikipedia article on addiction](https://en.wikipedia.org/wiki/Addiction),\n\n> Addiction is a brain disorder characterized by compulsive engagement in rewarding stimuli despite adverse consequences.\n\nAddiction is something I've struggled and have seen others struggle with (e.g. Bren). I think a lot of folks my age struggle with addiction; folks of all ages, I suppose.\n\nThemes of the year: sobriety and passion",
          "children": [
            {
              "content": "# Drugs\n\n* Alcohol, coffee, pot, hallucinogens\n* Escapism, enhancement, boredom\n* Fernborn\n* Metaphor: potions or perfumes\n\nResources:\n\n* [Pills](https://www.youtube.com/watch?v=hwFx0ROBf7o) by St. Vincent"
            },
            {
              "content": "# Success\n\n* Success, work, being special, productivity\n* Lyric\n\nReferences:\n\n* [Why Success Won't Make You Happy](https://www.notion.so/Notes-Why-Success-Won-t-Make-f4377f4282aa4b2699ddfacc18b35dc6)"
            }
          ]
        },
        {
          "content": "# Ages\n\n- Part One\n  - Gray childhood through teen (childhood -> coming of age)\n  - Lyric teenage to young adult (adolescence -> maturity)\n  - Haven as a young adult to an adult (adulthood -> responsibility)\n- Sequel could focus on Gray in adult life\n  - Time magic could allow connection to old characters\n  - Could feature Haven's death\n  - Lyric is becoming an elder\n  - Has incorporated lessons from entire Trinity\n- Gray's story starts with their childhood\n  - Follows a childhood structure\n  - Later, past vision of Haven shows their childhood\n  - Childhood structure is revisited but in different context\n  - Meant to show differences, similarities, comparisons between youngest years (Gray: wealthy and cared for, Haven: poor and abandoneded)"
        },
        {
          "content": "# Character interactions\n  - parallel stories: characters share a set (lighting and motionlessness used to shift time and focus)\n  - Gray imbuing origami made by Haven",
          "children": [
            {
              "content": "# Coordination\n\nI love the idea of predetermined reunions. Like Gray is having a birthday and they invite Lyric, you have to make a choice of making the party on time or pursuing a lead. This kind of coordination is also possible at a much smaller scale (like with Haven meeting a friend at a well at a certain time)."
            },
            {
              "content": "# Lock and key\n\nSome tools are only accessible to one character but usable by another. e.g. Gray (lens, glass, Fernborn) has glasses that become magical when used by Lyric (perspective)"
            }
          ]
        },
        {
          "content": "# Team dreams themes\n\nWhat if each had dreams (but only Gray had the ability to manipulate them, or each character had a different way of interacting with them).\n\nDreams have themes:\n\n- Depression: Whirlpool, ocean bed, ice, burying\n- Extremism: Shooting star, fire\n- Trauma: Labyrinths, curses, scars"
        },
        {
          "content": "# Familiars\n\nPresent in each culture?\n\n- Gray: Strong pet culture\n- Lyric: Overlapping migrations\n- Haven: Tied into spirit contracts\n\n---\n\nI was wondering whether with Lyric, the familiar embodies the things hidden (moon) from trim (rising) and tat (sun).\n\n---\n\nFamiliars in Riverspun... I forget. Something about symbols or migration. Troubles coming and going. Maybe something about being documentors? Symbol finders?"
        },
        {
          "content": "# Cross-application of tools\n\n- pass around tools/concepts between characters\n- e.g. Fernborn \"reaching for the stars\" (fortunetelling) <-  reinterpret the star tools used by Riverspun (navigation)\n- tools can be used or abused, not inherently good or bad"
        },
        {
          "content": "# Three gender system\n\nGray, Lyric, and Haven as representing a three gender system in the world?\n\nThree genders: energizing, stabilizing, de-energizing -> positive, neutral, negative\n\nCan't really map English genders to them. Avoid using he/she because English gender is so closely associated with male/female, which this system is not.\n\nAlso separate from morality system. No \"good vs bad\""
        },
        {
          "content": "# Symbolic sets\n\n- ⏀ bond, ⟐ mask, ⧋ reverie\n- ⏀ composition, ⟐ primitives, ⧋ abstraction\n- ⏀ crafting, ⟐ materials, ⧋ spells\n- ⏀ grouping, ⟐ node, ⧋ arrow\n- ⏀ performance, ⟐ perception, ⧋ planning\n- ⏀ share, ⟐ witness, ⧋ act\n- ⏀ collaboration, ⟐ categorization, ⧋ consequence\n- ⏀ coupling, ⟐ critique, ⧋ control"
        },
        {
          "content": "# Homelessness\n\nI've imagined Haven being homeless for a while, but lately I've wondered whether it would be better for Lyric (during their wandering phase).\n\nMy recent exchange with Aaron Leighton made me realize that the spirits also are dealing with homeless and forced relocation.\n\nThis is a topic I want to take seriously and respectfully. I haven't thought very much yet about the specific ways I want to explore it in the game yet.\n\nInspiration:\n\n- [Spirit City Toronto](https://www.aaronleighton.com/books#/spirit-city-toronto/)\n- [Shelter](https://www.notion.so/Shelter-f36b0f98eb65452e8b9a41816a046c88)\n- Bren\n- Homeless folk in NY and SF\n- Lady in the van from church"
        },
        {
          "content": "# Healing\n\nI expect healing to have a major role across plot and gameplay.\n* **Personal**\n  * Physical: disease, physical trauma\n  * Emotional: emotional trauma, abuse\n  * Mental: addiction, greed\n  * Spiritual: hopelessness, simulacra\n* **Societal**: discrimination, infrastructure\n  * Generational: reparations, genocide\n* **Environmental**: agriculture, deforestation",
          "children": [
            {
              "content": "# Healer's Journey\n\nAlternative to,\n* Hero's Journey\n* Fool's Journey (tarot)\n* Twelve Stages of Healing (network care)\n* Five Stages of Grief\n\nIt is the journey of healing oneself in order to heal others."
            },
            {
              "content": "# Core wounds\n\n- Core wounds\n- Keep hurting you in new ways, different faces, until healed\n- Through their healing we gain new perspectives and abilities\n- Without the wound, those lessons wouldn't have been learned\n- Curses as leading to / required by growth\n- Generational wounds, inheritance of curses"
            }
          ]
        },
        {
          "content": "# Queering the binary\n\n## 0 or 1, 0 to 1\n\nA bit: on or off\nA bit: yin or yang\nA bit: day or night\nA bit: pair of opposite\n\nWhat about the in-between? What the eff do you call something between 0 and 1?\n\nBits (binary) to spectra  (continuum)\n\n## 1, 2, more than 2\n\n- Two things makes a binary\n- Three things says there's something in between\n- Three is the beginning of shapes / circle\n- Three characters!",
          "children": [
            {
              "content": "Binary\nDiscrete\n\nDuality\nOpposites\n\nQuantum\nContinuum\n\nLine\nRange\n\nRatio\nProportion\n\nSpectrum\nGray area\n\nScalar\nMagnitude\n\nLightness (value)\nHue\n\nLinear (black/white)\nCircular (hue)\n\nLine\nCircle (sine, moon, tide, pendulum)\n\nVector\nDirection\n\nOrthogonal\nPerpendicular\n\nParallel\nEquivalence"
            }
          ]
        },
        {
          "content": "# Public, Private, Secret\n\nI hear about this concept in astrology.\n\n- Sun\n  - \"How you are seen by others\"\n  - Core, foundational\n- Moon\n  - \"How you see yourself\"\n  - Inner, prviate\n- Rising\n  - \"How you want to be seen\"\n  - Projected, aspirational\n\nI kept seeing a similar theme popping up in places around a public self, a private (intimate) self, and a secret self.\n\n- Public: we\n- Private: you\n- Secret: me",
          "children": [
            {
              "content": "# Sun, Moon, Rising\n\nI don't know too much about astrology, but I once heard that our signs represents different parts of us. According to Co-star\n\n<blockquote title=\"Co-star\">\nThe sun determines your ego, identity, and \"role\" in life. It's the core of who you are, and is the sign you're mostly likely to already know.\n\nThe moon rules your emotions, moods, and feelings. This is likely the sign you most think of yourself as, since it reflects your personality when you're alone and deeply comfortable\n\nYour ascendant is the \"mask\" you present to people.\n</blockquote>"
            },
            {
              "content": "# \"Japanese proverb\"\n\nI was talking to Bren about the astrology interpretation of sun, moon, rising, and he told me about something he read:\n\n<blockquote title=\"Proverb from Reddit, probably\" cite=\"https://japanese.stackexchange.com/questions/18973/question-about-supposedly-a-japanese-proverb\">The Japanese say you have three faces. The first face, you show to the world. The second face, you show to your close friends, and your family. The third face, you never show anyone. It is the truest reflection of who you are.</blockquote>\n\nIn trying to find the origins of this \"proverb,\" I came across a [question on Japanese Stack Exchange](https://japanese.stackexchange.com/questions/18973/question-about-supposedly-a-japanese-proverb) with a few theories.",
              "children": [
                {
                  "content": "# João Rodrigues on Japanese Craftiness\n\n<blockquote title=\"Description by Father João Rodrigues, c.1610\" cite=\"https://www.google.com/books/edition/Japan/xJxf1W74XSoC?hl=en&gbpv=1&bsq=%22They%20are%20so%20crafty%20in%20their%20hearts%20that%20nobody%20can%20understand%20them.%20Whence%20it%20is%20said%20that%20they%20have%20three%20hearts%3A%20a%20false%20one%20in%20their%20mouths%20for%20all%20the%20world%20to%20see%2C%20another%20within%20their%20breasts%20only%20for%20their%20friends%2C%20and%20the%20third%20in%20the%20depths%20of%20their%20hearts%2C%20reserved%20for%20themselves%20alone%20and%20never%20manifested%20to%20anybody.%22&pg=PA201&printsec=frontcover\">[The Japanese] are so crafty in their hearts that nobody can understand them. Whence it is said that they have three hearts: a false one in their mouths for all the world to see, another within their breasts only for their friends, and the third in the depths of their hearts, reserved for themselves alone and never manifested to anybody.</blockquote>"
                },
                {
                  "content": "# Japanese saying from *Shōgun*\n\n<blockquote title=\"Shōgun by James Calvell\">It's a saying they have, that a man has a false heart in his mouth for the world to see, another in his breast to show to his special friends and his family, and the real one, the true one, the secret one, which is never known to anyone except to himself alone, hidden only God knows where.</blockquote>"
                },
                {
                  "content": "# The Naming of Cats\n\n<blockquote title=\"The Naming of Cats by T. S. Eliot\" style=\"white-space: pre; overflow-x: auto;\">The Naming of Cats is a difficult matter,\n     It isn't just one of your holiday games;\nYou may think at first I'm as mad as a hatter\nWhen I tell you, a cat must have THREE DIFFERENT NAMES.\nFirst of all, there's the name that the family use daily,\n     Such as Peter, Augustus, Alonzo, or James,\nSuch as Victor or Jonathan, George or Bill Bailey—\n     All of them sensible everyday names.\nThere are fancier names if you think they sound sweeter,\n     Some for the gentlemen, some for the dames:\nSuch as Plato, Admetus, Electra, Demeter—\n     But all of them sensible everyday names,\nBut I tell you, a cat needs a name that's particular,\n     A name that's peculiar, and more dignified,\nElse how can he keep up his tail perpendicular,\n     Or spread out his whiskers, or cherish his pride?\nOf names of this kind, I can give you a quorum,\n     Such as Munkustrap, Quaxo, or Coricopat,\nSuch as Bombalurina, or else Jellylorum—\n     Names that never belong to more than one cat.\nBut above and beyond there's still one name left over,\n     And that is the name that you never will guess;\nThe name that no human research can discover—\n     But THE CAT HIMSELF KNOWS, and will never confess.\nWhen you notice a cat in profound meditation,\n     The reason, I tell you, is always the same:\nHis mind is engaged in a rapt contemplation\n     Of the thought, of the thought, of the thought of his name:\n          His ineffable effable\n          Effanineffable\nDeep and inscrutable singular name.</blockquote>",
                  "children": [
                    {
                      "content": "# Name glyphs in Divuthan culture\n\nIn a conversation at work, Glyph mentioned that his family has a history of self-given names. He shared how he came up with the name Glyph and shared an article he wrote about it on his blog. There, he explained that he also uses a glyph that is composed of a number of symbols drawn from a game he is working on.\n\n<blockquote title=\"Divuthan culture from Glyph's blog\" cite=\"https://glyph.twistedmatrix.com/2015/01/the-glyph.html\">There is an overarching philosophical concept of \"person-ness\" that this glyph embodies in Divuthan culture: although individuals vary, the things that make up a person are being (the body, coen), thinking (the mind, kset), belonging (the network, edec), making (tools, zenk) and communicating (paper and pen, lesh).</blockquote>"
                    }
                  ]
                }
              ]
            },
            {
              "content": "# The many names of a Fernborn\n\n**Public name**\n\n* Based on family and other circumstances of birth\n  * e.g. Astrology: syllable for each sun, moon, rising?\n* Name destiny ([onomancy](https://en.wikipedia.org/wiki/Onomancy))\n* Permanent, fixed, legal name, primary identifier\n\n**Intimate name**\n\n* Nickname: chosen by parents, friends, community\n* Maybe it works like an honorific\n\n**Secret name**\n\n* Chosen by the person themselves\n* Maybe it changes\n* Shared carefully, thought to carry power\n* Often associated with coming of age"
            },
            {
              "content": "# Perfume notes: public top, private bass\n\nI wonder if a Fernborn's personal perfume could tie into sun/moon/rising by leveraging the concept of \"notes\" in perfume theory. From Wikipedia,\n\n<blockquote title=\"Note (perfumery) from Wikipedia\" cite=\"https://en.wikipedia.org/wiki/Note_(perfumery)\">Notes in perfumery are descriptors of scents that can be sensed upon the application of a perfume. Notes are separated into three classes; top/head notes, middle/heart notes, and base notes; which denote groups of scents which can be sensed with respect to the time after the application of a perfume. These notes are created carefully with knowledge of the evaporation process and intended use of the perfume. The presence of one note may alter the perception of another—for instance, the presence of certain base or heart notes will alter the scent perceived when the top notes are strongest, and likewise the scent of base notes in the dry-down will often be altered depending on the smells of the heart notes.</blockquote>\n\nEach note could symbolize a different part of yourself, with top notes being more public and outward facing and base notes being more intimate."
            }
          ]
        },
        {
          "content": "# Wealth and Poverty\n\n## Accumulation of wealth\n\nI have a feeling that Capitalism would be a great thing to explore with this game. Specifically, the accumulation of wealth and the ways it changes a culture for the \"worse\" or the \"better.\"\n\nDifferent scales of wealth and its pursuit create environments in which specific patterns and systems may emerge.\n\n## Classism\n\n<blockquote title=\"Classism on Wikipedia\" cite=\"https://en.wikipedia.org/wiki/Class_discrimination\">Class discrimination, also known as classism, is prejudice or discrimination on the basis of social class. It includes individual attitudes, behaviors, systems of policies, and practices that are set up to benefit the upper class at the expense of the lower class or vice versa.</blockquote>\n\nGreat opportunity to analyze examples of classism in our world through this lens. Not sure how yet, but wanted to make a note to get back to it later.\n\nInitial thoughts:\n\n- How the US gov didn't help post-storm Puerto Rico\n- People not giving to the homeless\n- Brand names and status symbols\n- Poor given limited access to health, education, and other human rights\n\n## Possible narrative elements\n\nLet's say that in this world where implants are so common and cheap for the upper class or those living in city centers, some are surprised to see the commonness of physical disability in the outside world. Maybe a character from the Growths walks with a cane because of some childhood accident, people in the City would likely take notice, since the tech and culture exist where it's expected you \"fix\" the issue. If I were to do this, I'd want to talk to someone who uses a cane or has another visible and lower-intrusive physical disability. I'd want to ask them the ways that using a cane has shaped them, given them perspective, led to strengths and positive adaptations."
        },
        {
          "content": "# Labyrinths\n\nThe inside of one is just the outside of another."
        },
        {
          "content": "# Tuning in, alignment\n\n**Word cluster**\n\n- Frequency\n- Tuning\n- Adjusting\n- Synchronizing\n- Aligning\n- Coordinating\n- Rhythm\n- Calibration\n- Timing\n\n**Physical examples**\n\n- Finding you rhythm while exercising: your body's internal speed vs how hard you're controlling it\n- Matching or interacting with someone else's pace in a race\n- Orchestras coordinating around a conductor\n- Partners dancing\n\n**Tuning in**\n\n- Tuning into your body / the world around you\n- Tune into smell\n- Tune into a certain frequency\n  - Sprinting vs resting vs sustaining\n- Mindfulness is so not about the mind, it's tuning away from your mind and into your whole body"
        }
      ]
    },
    {
      "content": "# Comparison"
    },
    {
      "content": "# Knowledge & Perception\n\nThis is a big topic I need to fill in",
      "children": [
        {
          "content": "# Perception\n- Represent alternate realities\n- Make non-physical things tangible\n- Umwelt\n- \"How do you define energy\"\n  - Physical (heat, current)\n  - Non-physical (sexual, spiritual, social)\n  - Something that moves you\n- View non-visual reality\n- Memories, fantasies, \"frequencies\"\n- What are the foundational cultural elements?\n- How do folks interact with + communicate about them?\n\nExamples\n\n- Listening to the rain in *Away*\n- Make believe drawings in *Knights on Bikes*\n- Play with memory\n- Rose colored glasses\n- Flashbacks\n- Mirrored/parallel time"
        },
        {
          "content": "# Knowledge\n\nMaybe the characters gain pieces of \"knowledge\" based on their experiences. This includes stuff like heuristics, facts, trauma, biases, prejudice, mnemonics, lessons, muscle memory. Over time, you accumulate this stuff no matter which path you take through the game. Some of the knowledge helps you (e.g. how to quickly tie a knot), but some of it harms you (e.g. punitive beliefs about yourself). As your character matures, they find ways to give up outdated beliefs, balance ingrained reaction, and fill in gaps"
        },
        {
          "content": "# Ability graphs\n\nGraph theory to determine skill dependency. Could generalize to access, i.e. accessibility"
        },
        {
          "content": "# Sources/types of knowledge\n\n- Science\n- Song, poem\n- Folklore\n- Mnemonic\n- Maxim\n- Tacit\n- Mistakes, pain, trauma",
          "children": [
            {
              "content": "# The (R)Evolution of Indigenous Foods\n\nhttps://www.youtube.com/watch?v=RhkJ-tSLUKk\n\n- What are pre-colonial foods and where did they go?\n  - Need to understand colonialism\n  - Dictionary definition of colonialism is so simplified\n- Colonialism has happened to basically the whole globe at this point\n- Manifest destiny\n  - Country was built on the notion that we owned whatever we found\n- Very young country\n - Lots of traumatic change in a short amount of time\n  - What time to heal?\n- 1800s were the most deadly century\n  - 1880: US is basically just the 13 colonies \n  - Most of the rest of the landmass was occupied by indigenous people\n  - Still super diverse\n  - 1800: 80% native control, 1900: 2% (via reservations)\n- Grandpa born in 1850s\n  - Saw fighting between Lakota and government\n  - [Battle of Little Bighorn](https://en.wikipedia.org/wiki/Battle_of_the_Little_Bighorn) (\"Custer's Last Stand\")\n  - Kids go to boarding school: cut their hair, learn English, learn Christianity\n  - Children grow up and fight for US gov\n- US government very \"efficient\"\n  - [Indian Removal Act](https://en.wikipedia.org/wiki/Indian_Removal_Act) (1830), Trail of Tears\n  - [Homestead Act](https://en.wikipedia.org/wiki/Homestead_Acts#Homestead_Act_of_1862) (1862), Western US allocated to settlers\n  - [The Indian Appropriations Act](https://en.wikipedia.org/wiki/Indian_Appropriations_Act#1871_Act), (1871) no longer sovereign nations + no more treaties\n  - [Dawes Act](https://en.wikipedia.org/wiki/Dawes_Act) (1887), broke up reservations into plots\n  - Systematic bison hunting (end of century, only ~500 left)\n- George Washington\n  - Ordered General Sullivan to be pushed out all native people ([Sullivan Expedition](https://en.wikipedia.org/wiki/Sullivan_Expedition) exterminated NY area)\n  - Set president for rest of history\n- Loss of education between generations\n  - Didn't learn lessons passed on by ancestors\n  - Intense assimilation\n  - Boarding schools: military-style school, forced to speak new languages, religions, \"modern\" skills, abuse of many kinds\n- 1900s are \"better\"\n  - Citizens, 1924\n  - 40s-60s: more tribes dismanted\n  - Voting rights, 1965\n  - Religious freedom, 1978\n- Many groups poor\n  - Commodity food program: canned food\n- Country still has a bunch of indigenous diversity\n  - Biomes\n  - Languages\n  - 634 tribes in Canada, 573 in US, 20% of Mexico\n- Enormous colonial settler states vs small and diverse indigenous territories\n  - Why have the same foods all across the country instead of local?\n- Learn plants, see food and medicine everywhere\n  - Tons of staples: prairie turnip, camas root,  wild rice, seaweed, desert foods\n  - Native agriculture doesn't use pesticides and \n  - Goes back really far and sustain large civilizations\n  - Existed in diverse places\n- So much diversity\n  - We need to protect it\n  - We are the stewards of this knowledge\n  - So much was wiped out during colonialism\n  - Thing will disappear without our learning and spreading it\n- Diverse food is everywhere\n  - Don't call things weeds just because you don't know what they are\n  - We could make pantries that taste like where we live\n  - Unique to our region\n- Food back into tribal communities\n  - Break cycle of reliance on government food\n  - Huge rates of diabetes, obesity, heart disease\n  - Low nutritional food base provided by gonvernment\n- Use land space better\n  - Lawns are fucking stupid\n  - More community gardens \n  - 30 golf courses in Palm Springs (a desert); think of what we could do instead\n  - Just grow food everywhere\n  - Organic food that likes to grow in that region\n- Indigenous communities and knowledge all around the world, not just US\n  - Africa, India, SE Asia, Australia, New Zealand, Hawaii, South America, North America\n  - Everyone needs to be protected\n  - We should celebrate diversity instead of building wall to keep others out\n  - Global colonial structure has left their wisdom untapped and fading\n- Indigenous food sovereignty\n  - Healthy food access\n  - Cultural food producers\n  - Local food systems (not governmental control)\n  - Legal control of food systems\n  - Access to indigenous education\n  - Environmental protection",
              "children": [
                {
                  "content": "# Indigenous education\n\n- Wild food\n- Permaculture\n- Native agriculture\n- Seed saving\n- Seasonal lifestyles\n- Ethno-oceanography\n- Hunting\n- Fishing\n- Whole animal butchery\n- Mycology\n- Salt, sugar, fat production\n- Crafting\n- Land stewardship\n- Cooking\n- Metallurgy\n- Indigenous history\n- Traditional medicine\n- Food preservation\n- Fermentation\n- Nutrition\n- Health\n- Spirituality\n- Gender roles\n- Sustainability"
                }
              ]
            }
          ]
        },
        {
          "content": "# Internal reprentations\n\nThe dragon with each of us (and the fairy, goblin, ... ?)"
        }
      ]
    },
    {
      "content": "<div class=\"section\">Systems & Mechanics</div>\n\n\nGameplay and the world/systems it utilizes + explores"
    },
    {
      "content": "# Systems\n\nUnderlying models + rules",
      "children": [
        {
          "content": "# Birds\n\n- Bird drama interlude\n- Record bird songs\n  - Sample in music making\n- Catalog all species\n- Songs and noises as instruments in ambiance\n- Signaling and wayfinding\n- Alternate perspectives",
          "children": [
            {
              "content": "# Bird Drama\n\nBirdwatching mechanic where you can witness bird behavior personified/dramatized. I imagine that these are prompted by remaining still and watching, maybe after noticing a subtle cue.\n\n* Mating displays\n* Territory disputes and negotiation\n* Cleaning and hygiene\n* Feeding\n* Mutual care\n* Flourishes"
            }
          ]
        },
        {
          "content": "# Gathering\n\n*Gathering, sourcing, documenting, recording, witnessing, collecting, sampling.*\n\nGather elements from all over and apply them in new contexts.",
          "children": [
            {
              "content": "# Examples\n\n- Sketch the colors of a slime mold and apply them as a pattern to your clothing.\n- Keep pieces from your old clothes and make them into a quilt.\n- Listen to a loon's call and incorporate it into a song."
            },
            {
              "content": "# Curation\n\nMaybe there's another mechanic built in that prevents this from being a \"catch em all\" goal. Instead, I'd like to encourage people to practice discernment: what do they like, what is more valuable than something else, what must be discarded?\n\n\"Collection\" is a related theme.\n\nIn real life, we have physical containers like:\n- A photo album\n- A box of buttons\n- A cassette recorder\n- An altar"
            },
            {
              "content": "# Flourishes\n\nFlourishes, accents, highlights, garnishes, expressions, ornaments, embellishment.\n\nIt's the cherry on top. A flick of the wrist.\n\n- On clothes, maybe these looks like patches, trims, tassels\n- In music, these might be solos and embellishments\n- In dance, this might be an fancy transition or an end pose\n\nI imagine bird drama has a lot of opportunity for flourishing"
            },
            {
              "content": "# Inspiration\n\n- *[Season](https://store.steampowered.com/app/695330/Season/)* is a game about recording. In the trailer, there's a cool bit where the protagonist records the wings of a dragonfly\n- *Pokémon Snap*\n- Japanese helmet book: natural forms inspiring costuming"
            }
          ]
        },
        {
          "content": "# Enactment\n\nYour body actually doing something. Very tied to the controller / input source. Physical in natural.\n\nRelated to moment of attack?\n\nThis is important for things like dances or sports or secret handshakes.\n\nOriginally, I had envisioned it for the mechanical processes involved in cooking, which *[Potion Craft: Alchemist Simulator](https://store.steampowered.com/app/1210320/Potion_Craft_Alchemist_Simulator)* also explores."
        },
        {
          "content": "# Scent and Perfume\n\n- Smell connected to memory\n- Scent as ephemeral and hard to describe\n- World of smell and pheromones is rich (for non humans)\n- Dreams representing scent and instinct\n- Perfume as trail out of maze\n  - If the dream ends up being a mechanic like a maze, maybe you can use scent trails and \"breadcrumbs\" to help you (accessibility)\n- Nerves in nose are very close to brain\n  - Brain eating bugs and bacteria can start in nose\n  - In game, corruption can seep in through nose (dreams? perfumes as mental poison?)\n- Visualize scent like in [Ratatouille](https://www.youtube.com/watch?v=rLXYILcRoPQ)?\n- Insect 3d scent? Dog and cat territory?"
        },
        {
          "content": "# Composition\n\n- crafting & composition\n  - bonds to hold things together?"
        },
        {
          "content": "# Sayings\n\n- Saying\n- Mnemonic\n- Aphorism\n- Adage\n- Epigram\n- Proverb"
        },
        {
          "content": "# Fated decision making\n\n*aka automotical choices*\n\nNo dialog choices. Dialog happens automatically, but under the hood there are choices that are determined by the other actions / choices you do make in the game.\n\n\"Intervening\" could be an action. It's an intention to apply your will to the current situation: options that would have been automatically chosen you now have the ability to chose for yourself."
        },
        {
          "content": "# Story problems\n\n\"Story problems\" as small, self-contained problems found in context. Optional / opportunities. The mechanic depends on the problem. It may have skill dependency and the game ensures you're equipped to solve it."
        },
        {
          "content": "# Open time & major pivots\n\n- Open ended / \"free\" time vs pivotal moments and events\n\nI was playing Hades and realizing it's rewarding to spend a lot of time getting to know something (esp in an embodied way). You get to know them slowly over time. I still don't like the idea of grinding, but I think there's something nice about spending a lot time with something.\n\nI wondered if there could be important + pivotal moments that are affected by the things you do in your free time between them"
        }
      ]
    },
    {
      "content": "# Mechanics\n\nWays of interacting with systems",
      "children": [
        {
          "content": "# Expressing gratitude\n\nA skill you can build\n\n- For people, it's saying thanks\n  - Casual thanks and serious thanks\n  - e.g. Politeness, a letter to an old teacher\n- For nature, maybe it's appreciating\n  - e.g. Stopping to watch the sunset, smell a flower\n- But also a dark side: too much thanks"
        },
        {
          "content": "# Dinner parties\n\n- You're going to dinner at a guest's house\n- Earlier, you had to make a choice to prioritize something else or this dinner\n- If you prioritized the other thing, you're running late\n- You can only pick one thing to do before now and the party\n  - Grab a gift for the host\n  - Put on fancier clothing\n  - Clean your face and hair\n- Depending on the culture, the choices have different impact\n  - Maybe a nice gift (of a certain kind) is highly esteemed\n  - Might be that you're social value is judged by your clothing\n  - Being dirty could be an insult\n- Give an incentive to pay attention to the culture\n  - Dig into opportunities, follow rabbit holes, express interest\n  - Prioritize events that focus on culture and society"
        },
        {
          "content": "# Small activities\n\n* Untangling knots\n* Humming for oneself\n* Cutting vegetables\n* Sweeping floor\n* Racing on the playground\n* Shucking corn\n* Flying a kite"
        },
        {
          "content": "# Emergent Mechanics\n\nI'd like to make a really interesting network of systems that lend themselves to playing with. I see interesting mechanics emerging from an underlying problem space defined by the game's models and their interactions."
        },
        {
          "content": "# Time magic allowing \"teleportation\"\n\nUse \"future vision\" to plan out path starting at the present moment.\n\nWant to avoid affecting large changes or going too far; otherwise, the world might be very different when you arrive. If you're seen or knock something over (e.g.), you can open your eyes and arrive back at the present moment at your original.\n\nIf you make it to your destination, you can convert the series of actions that you perceived into actual actions you took. Rather than envisioning them, you actually did them.\n\nThe more familiar you are with a path, the more you can do without thinking.\n\nMechanically, this is like stealth exercise\n\nGray + Lyric?"
        },
        {
          "content": "# Playground games\n\nA game like \"it\" or the disease in Bomber Man: if you get touched, you carry the curse until you pass it on. Maybe it's characterized on the islands as an evil spirit possessing you; the adults don't like it when the kids play it."
        },
        {
          "content": "# Affirmations + self criticism\n\nI'm imagining a mechanic that explores \"manifestation.\" Saying/hearing -> believing -> reinforcing.\n\n- Self-fulfilling prophecies\n- Affirmations\n- Self affirmations\n- Criticism\n- Self criticism\n- Identity\n- Curses\n\nConsider the difference between expressing \"I am\" and \"I feel.\" One implies fixation, the other implies spontaneity.\n\nThe more you say it, the more you believe it. The more you hear it, the more you believe it. You become the things you say about yourself. You become the things you hear about yourself.\n\nI keep using saying/hearing as auditory metaphors, but of course this also applies to people who can't speak or hear, e.g. deaf people. The more inclusive version might be \"say/hear -> express/received.\"\n\nMaybe there's another element which looks at the tension caused when the outside world differs from the inner world. You believe something about yourself but you express something that is not aligned with that.\n\n- \"I'm bad at math\"\n- \"You're the smart one; you're the pretty one\"\n- \"I have bad memory\"\n- \"You're too needy\"\n- \"I'm beautiful and confident and kind\"\n- \"You're such a good boy\""
        },
        {
          "content": "# Observing a moment\n\n- Beach time\n  - Pelicans circling the beach + inlet, riding wind pushed up by cliffs\n  - Crows harassing a falcon and the falcon fighting back\n  - Blue/green water as the sun shone through wind-woken waves; silvery and sparkling as it reflected on top of the oscillating ocean\n  - Trying to guess how the clouds and their boundaries formed/worked\n    - Lower clouds forming over the ocean, the wind hits the coast and blows the wind and moisture to a higher elevation where it is influenced by other currents\n- On the way back\n  - Catching the sun dipping below the horizon, a shining drop of amber\n  - Seeing a little bird harass a falcon away from its friends and family\n  - The tops of trees were golden"
        },
        {
          "content": "# Pursuing a lead\n\n- Leads\n- Suggestions\n- Rumors\n- Bounties\n- Gossip\n- Intel\n- Quests\n- Doors\n- Opportunities\n- Legends\n\nOpportunities to pursue something. Maybe be true and valuable or may be a dud (but you are still changed for having tried)\n\nThis hopefully fulfills my dream of going on a journey to find a specific/rare teacher, material, or artifact"
        },
        {
          "content": "# Book indexing\n\n- Book indexing as a profession\n- Using indexes\n- Codes and other surprises hidden in indexes\n\nhttps://www.prospectmagazine.co.uk/arts-and-books/the-radical-power-of-the-book-index-history-review"
        }
      ]
    },
    {
      "content": "# Tools\n\nTools (and toys) to play with systems",
      "children": [
        {
          "content": "# Color pallet tool\n- mood or ambiance\n  - greens and blues = calming\n  - rainbow = exciting\n  - beige = uniformity\n- time of day\n  - dawn and dusk: gradients\n  - noon: high-contrast shadows\n  - night: blue, indigo, purple, black"
        },
        {
          "content": "# Time of day tool\n\n- golden hour = picturesque, fleeting\n  - strolling\n  - flirting\n- high noon = aggressive\n  - taking shelter in shade\n- sunrise = waking up\n  - quiet, birds singing\n  - mist rising, light gathering"
        },
        {
          "content": "# Night sky tool\n\n* moon in phase\n* guide stars\n* seasonal constellation"
        },
        {
          "content": "# Pruning tool\n\n* Show the growth patterns of certain plants\n* Teach basic botanical concepts\n* Show pruning techniques\n* Simulate growth after specific pruning cuts\n* Build intuition about how pruning works"
        },
        {
          "content": "# Anatomy tool\n\n* Show what's connected\n* Explore injury and remedy\n\ne.g. My knee hurts, see the specific tissue, its surroundings, and what it's connected to in the larger network"
        },
        {
          "content": "# Seasonal growth tool\n\n* See when things should be planted\n* See when things ripen\n* Learn good and bad conditions for plants"
        },
        {
          "content": "# Soundtrack tool\n\n- Picking a song for the moment\n- The song you pick reflects the tone / mood / interpretation\n- Like, while walking through part of the landscape\n  - Melancholy, quiet, longing\n  - Determined, moving, steadfast\n  - Playful, meandering, light"
        },
        {
          "content": "# Tools as magical conduits\n\n- Camera\n  - Capture moments at location at different times\n- Telescope\n  - See far-away through objects\n- Glasses\n  - Apply filters onto the world to see more/less\n- Drum\n  - Animate automata through song\n- Soup pot\n  - Influence dreams of dinner guests \n\n\n- Key\n- Mirror\n- Walking stick\n- Vial\n- Tarot cards\n- Perfume\n- Necklace, Bracelets, Rings"
        },
        {
          "content": "# Vessels\n\n- Vessel\n- Conduit\n- Medium\n- Channel\n- Totem\n- Relay\n- Vehicle\n- Instrument"
        },
        {
          "content": "# Tools as power\n\n- Tools as power\n- Must be learned\n- Gain precision and new techniques\n- Latent, unrealized by itself\n- Manipulate other materials\n- Can be used for various effects"
        },
        {
          "content": "# Teaching physics\n\nPhysics! The game could teach about the physical world so well.\n\nI don't know what the mechanics are yet, I have to build the model and the tools first.\n\nCalculus, aerodynamics, projectiles, gravity, reflection, balancing\n\nIt makes sense that these tie into physical controls + mechanics"
        },
        {
          "content": "# Visualizing fluid dynamics\n\nBird drama!\n\nI was watching some birds fly at the beach. There were about five of them in a line, I didn't identify them. They were moving synchronously, following a smoothly rolling wave through the air.\n\nThe first would flap its wings in smooth ascent, each bird behind it following consecutively, a moment later. It would stop its wings to glide slowly downward and again its trail smoothly followed.\n\nI imagined that the air as something more tangible, like water. I wondered whether the birds sensed the subtle movement of the air, the wake of its disturbance. It is an invisible ribbon, one that can only be felt through its passage. Their curve was a snake swimming over sand.\n\nThis could be visualized and maybe help give an example of drag, aerodynamics, fluid dynamics."
        },
        {
          "content": "# Althete's training\n\n- Stretching\n- Warmups\n- Breathing\n- Nutrition\n- Pacing\n- Rest\n- Intuition\n- Proprioception aka being in tune with your body"
        },
        {
          "content": "# Spirit lures\n\nIncense/perfumes attract certain kinds of spirits. Use them as a lure to affect dream or gain powers. Like flower scent luring pollinators or pheromones guiding ants.\n\n- Perfume\n- Pollination\n- Lures\n- Pheromones\n- Traps\n- Legend of Mama instruments\n"
        }
      ]
    },
    {
      "content": "<div class=\"section\">Game & Aesthetics</div>\n\n\nArt style, music and sound, assets, game stuff"
    },
    {
      "content": "# Space",
      "children": [
        {
          "content": "# Types of settings\n\n- how might we categorize \"places\" we occupy?\n- tools to help create each\n- each has a different\n  - tone and ambiance\n  - focus or purpose\n  - types of events and activity\n  - tendencies\n- examples\n  - bedroom: small, self-contained, personal, dynamic\n  - cathedral: massive, spiritual, shared, static",
          "children": [
            {
              "content": "# Scenery\n\n*natural landscapes, large spaces, ambiant*\n\n- a market\n- a hilltop\n- a garden\n- a pond\n- a meadow"
            },
            {
              "content": "# Work contexts\n\n*inventories, organized, optimized, specific*\n\n- a workshop\n- a kitchen (counter?)\n- a garden (shed?)\n- a bedroom\n- a desk (or study)\n"
            },
            {
              "content": "# Habitation\n\n*regularity, residence, dwelling, haunts*\n\n- a community well\n- a home\n- a diner or bar\n- the big tree behind the school\n- The Lamp Shop"
            },
            {
              "content": "# Interstice\n\n*passages, in between, connecting, incidental*\n\n- down the block\n- roads between milestones/waypoints/towns\n- the years in between\n- hallways\n- ancient trails and pathways\n  - mix of passage, monument, scenery"
            },
            {
              "content": "# Monuments\n\n*spectacles, sacred places*\n\n- a cathedral\n- a shrine\n- a grand waterfall\n- a thunderstorm\n- The Glass Orrery"
            }
          ]
        },
        {
          "content": "# Theater sets\n\nI'd like to take inspiration from theater sets.\n\n* Movable, modular set pieces\n* Lighting to shift focus\n* A few props to fill the scene\n* Open + viewable from many angles\n\nSources:\n\n* Maps from Final Fantasy Tactics\n* Kentucky Route Zero"
        },
        {
          "content": "# Game inspiration",
          "children": [
            {
              "content": "# Hitman Go\n\n![](https://www.filepicker.io/api/file/Hr6j8K3cTimuRGxy9Nl7)"
            },
            {
              "content": "# Final Fantasy Tactics\n\n![](https://www.filepicker.io/api/file/T0fKibBeTQ2SR6ZpQnra)"
            },
            {
              "content": "# Kentucky Route Zero\n\n![](https://www.filepicker.io/api/file/uVQPPzXzSm6r0xII7mWQ)"
            },
            {
              "content": "# Harold Halibut\n\n![](https://www.filepicker.io/api/file/20eBWRMSvedqywZAJHd9)"
            },
            {
              "content": "# Lumino City\n\n![](https://www.filepicker.io/api/file/JRhTSEgmTDmVRsjOPxYg)"
            },
            {
              "content": "# The Gardens Between\n\n![](https://www.filepicker.io/api/file/NnAC4KuPTv2mLVaBfBN6)"
            },
            {
              "content": "# Monument Valley\n\n![](https://www.filepicker.io/api/file/HoLVWrvzQ1uYfgdB8RHS)"
            },
            {
              "content": "# The Almost Gone\n\n![](https://www.filepicker.io/api/file/u3j8zXKhRAZTJYEKPbfu)"
            }
          ]
        }
      ]
    },
    {
      "content": "# Game philosophy",
      "children": [
        {
          "content": "# Why a game?\n\n* It's what I know, what I have passion for\n* Game industry is really limited right now, there's a ton of opportunity to enrich and explore the medium\n  * \"Traditional gamers\" need help, don't have a lot of good teachers or role models in games\n* Don't want to \"teach\" people, want to give opportunities for play\n  * Game topics not intended to replace their physical counterparts; aimed to be an intro/inspo to spark interest to explore in the world\n* Want to incorporate a story into the larger topics I'm exploring"
        },
        {
          "content": "# \"Educational game\"\n\nI do see the game having \"educational\" elements (like learning how to read the night sky or learning about animal behavior) but I don't want it to feel like a traditional educational game. I think folks are generally good at seeing through appearances and don't like being \"taught at.\"\n\nIdeally, I'd like to build the engine and tools so that folks could use the systems already encoded to build more straightforward \"educational experiences\" if the wanted."
        },
        {
          "content": "# Feeling of adventure\n\nFeeling of *Zelda: Link to the Past*\n* adventurous\n* self contained\n* evocative\n* otherwordly\n* heroic\n\nImagining a more inclusive vision of the Hero's Journey, we could see the type of adventure exemplified by Zelda just one portion of a larger journey\n\nHealer's Journey?",
          "children": [
            {
              "content": "Imagine *Part One* having three Zelda-like games. Each is small and cozy, focused on the adventure of individual characters.\n\nInteract with a shared world, sometimes with overlap. Feel separate and self-driven but move within a larger current."
            },
            {
              "content": "Each character with their own heroic arc. Adventure is only a part of the journey; others parts center around healing, resolution, doldrums.\n\nFull arc of a character may span many games, but each game is self-contained. *Part One* might have the adventure of one and the maturity of another."
            }
          ]
        },
        {
          "content": "# Unsolvable problems\n\nImportant problems are complex problems, and complex problems require complex solutions—if they have solutions at all. While I want Part One to feel hopeful and empowering, I also want to recognize that life is messy, that right vs wrong isn't so clear, and that not everything can be \"fixed.\"\n\nThis is at odds with many ideas of games that have win conditions. Is it possible to make a (satisfying) game without \"winning.\" Perhaps sub-systems will be successfully completed but the larger system, like life, will continue unresolved.\n\nInspiration:\n\n* \"[We need an alternative to the Hero’s Journey](https://www.notion.so/We-need-an-alternative-to-the-Hero-s-Journey-f31265b16b1240b8a5ea51b52f543fa9)\""
        },
        {
          "content": "# Play, exploration, interaction\n\nIt's an interesting world that you can interact with in playful ways. Doesn't try to force things on you, lets you explore. Usually aren't given things, need to experiment. The \"core loop\" could be just occupying the world and interacting with it. A central story moves you through the world and decides what you encounter."
        },
        {
          "content": "# Show don't tell\n\nInstead of \"trying to say something\" about certain topics, just portray them honestly. Like, instead of making judgments about substance abuse, just show someone's complex experience with it."
        },
        {
          "content": "# Competitive vs expressive art forms\n\n- art forms: competitive vs expressive\n  - sometimes, a loss: professional ballet ruins joy\n  - birding that only focuses on checking the boxes vs just watching the birds\n  - competition gives you a drive, must become better at it\n  - obsession, a drive to improve"
        },
        {
          "content": "# Magic Circle\n\nDuring your developmental years, you may play little games with your friends. Tag, hide and go seek, dates, etc. How you play in these games affects the way you develop and form social bonds.\n\nOne specific concept I'd like to explore is the idea of the magic circle or imaginary boundaries that exist to delineate special or sacred space. For example, during a game of war with your friends, you may draw lines in the dirt to designate some border. Physically, you may cross the line, but doing so breaks the contact of the game. If you are caught, there may be consequences from your peers; if you aren't, you may develop habits of rule breaking or cheating.\n\nSince it's a game, we can add cool little effects or visualizations.\n\nI'd like to be a concept introduced early on so that it can grow and mature throughout the game.\nGames can do all sorts of things like physically preventing you from going into an area, but I'd like it if some of those limitations were enforced by the player themselves instead of the game. Or to make it unclear which rules are really enforced, requiring risk to check."
        },
        {
          "content": "# Narrative *Breath of the Wild*\n\nLike a narrative BotW, except instead of the mechanics being centered around violence, they're used to solve problems in and about nature, relationships, queerness, culture."
        }
      ]
    },
    {
      "content": "<div class=\"section\">Development & Creation</div>\n\n\nHow the game will be made"
    },
    {
      "content": "# Project",
      "children": [
        {
          "content": "# <strike>10</strike> 15 Years\n\n* It would be great to release/share tools and learning along the way (especially if I eventually take donations)\n* Some ideas need a lot of time to mature\n* Things need to grow together and settle into each other\n* Sometimes an idea needs a partner\n* Trying to earn/save up a lot of money (taking from tech industry)"
        },
        {
          "content": "# Leading by example\n\naka, Be the change you want to see.\n\nIt's important to me that this project practices what it preaches. I hope to influence the world by acting in the way I would like other to act."
        },
        {
          "content": "# Funding\n\nSelf funded? Free?",
          "children": [
            {
              "content": "# Avoid relying on outside funding\n\n* Investors expect a return; I'm not attempting to make money\n  * Don't want to be beholden to their profit-motivated influence\n* I don't see crowdfunding working out; don't want to invite mass expectation\n* I would take personal, anonymous donations"
            },
            {
              "content": "# Self funding\n\n* I'm saving up!\n  * Enough for myself, not sure when/if I'll be able to pay others\n  * Stocks fluctuate around $150,000\n  * Savings is $30,000"
            },
            {
              "content": "# Giving it away for free\n\n* Want it to be accessible to as many people as possible\n  * Financial cost, within the US and relative to other countries\n  * Governments could censor marketplaces / distributors\n* Give folks opportunity to pay/support if they want\n  * e.g. Free on website (which contains more info about project) but priced on Steam (game marketplace context; less context on project)\n* People gather around what they can access; more likely to build community\n* But also why not make a bunch of money?"
            }
          ]
        }
      ]
    },
    {
      "content": "<div class=\"section\">Research & Reference</div>\n\n\nA place to put stuff I’ve researched"
    },
    {
      "content": "# Research",
      "children": [
        {
          "content": "# Personality Theory",
          "children": [
            {
              "content": "# Holland Codes\n\nFrom the [Wikipedia entry](https://en.wikipedia.org/wiki/Holland_Codes)\n\n> Holland originally labeled his six types as \"motoric, intellectual, esthetic, supportive, persuasive, and conforming.\"\n>\n> [A]n alternative way of categorizing the six types would be through ancient social roles: \"hunters (Realistic), shamans (Investigative), artisans (Artistic), healers (Social), leaders (Enterprising), and lorekeepers (Conventional).\"\n\n* Realistic (Doers, things)\n* Investigative (Thinkers, data)\n* Artistic (Creators, ideas and things)\n* Social (Helpers, people)\n* Enterprising (Persuaders, people and data)\n* Conventional (Organizers, data)\n\n> Graphed as a hexagon, it is a circumplex that can be mapped onto two underlying dimensions: **Data/Ideas** and **Things/People**",
              "children": [
                {
                  "content": "# Realistic (Doers)\n\n> People who like to work with \"**things**.\" They tend to be \"assertive and competitive, and are interested in activities requiring motor coordination, skill and strength.\" They approach problem solving \"by doing something, rather than talking about it, or sitting and thinking about it.\" They also prefer \"concrete approaches to problem solving, rather than abstract theory.\" Finally, their interests tend to focus on \"scientific or mechanical rather than cultural and aesthetic areas.\""
                },
                {
                  "content": "# Investigative (Thinkers)\n\n> People who prefer to work with \"**data**.\" They like to \"think and observe rather than act, to organize and understand information rather than to persuade.\" They also prefer \"individual rather than people oriented activities.\""
                },
                {
                  "content": "# Artistic (Creators)\n\n> People who like to work with \"**ideas and things**\". They tend to be \"creative, open, inventive, original, perceptive, sensitive, independent and emotional.\" They rebel against \"structure and rules\", but enjoy \"tasks involving people or physical skills.\" They tend to be more emotional than the other types."
                },
                {
                  "content": "# Social (Helpers)\n\n> People who like to work with \"**people**\" and who \"seem to satisfy their needs in teaching or helping situations.\" They tend to be \"drawn more to seek close relationships with other people and are less apt to want to be really intellectual or physical.\""
                },
                {
                  "content": "# Enterprising (Persuaders)\n\n> People who like to work with \"**people and data**.\" They tend to be \"good talkers, and use this skill to lead or persuade others.\" They \"also value reputation, power, money and status.\""
                },
                {
                  "content": "# Conventional (Organizers)\n\n> People who prefer to work with \"**data**\" and who \"like rules and regulations and emphasize self-control ... they like structure and order, and dislike unstructured or unclear work and interpersonal situations.\" They also \"place value on reputation, power, or status.\""
                }
              ]
            },
            {
              "content": "# Enneagram",
              "children": [
                {
                  "content": "# Types",
                  "children": [
                    {
                      "content": "# 1. Reformer, Perfectionist\n\n*principled, purposeful, self-controlled, and perfectionistic*\n\n## Categories\n\n- Triad: **Instinctive**\n- Social style: **Compliant**\n- Coping style: **Competency**\n\n## Correspondences\n\n- Desires: **Goodness, integrity**\n- Passions: **Anger**\n- Fears: **Corruption**\n- Fixations: **Resentment**",
                      "children": [
                        {
                          "content": "> **Ones** attempt to control or repress their anger and instinctual energy. They feel that they must stay in control of themselves, especially of their instinctual impulses and angry feelings at all times. They would like to direct these energies according to the dictates of their highly developed inner critic (superego), the source of their strictures on themselves and others."
                        }
                      ]
                    },
                    {
                      "content": "# 2. Helper, Giver\n\n*generous, demonstrative, people-pleasing, and possessive*\n\n## Categories\n\n- Triad: **Feeling**\n- Social style: **Compliant**\n- Coping: **Positive outlook**\n\n## Correspondences\n\n- Desires: **Love**\n- Passions: **Pride**\n- Fears: **Unloved**\n- Fixations: **Flattery (Ingratiation)**",
                      "children": [
                        {
                          "content": "> **Twos** attempt to control their shame by getting other people to like them and to think of them as good people. They also want to convince themselves that they are good, loving people by focusing on their positive feelings for others while repressing their negative feelings (such as anger and resentment at not being appreciated enough). As long as Twos can get positive emotional responses from others, they feel wanted and are able to control feelings of shame."
                        }
                      ]
                    },
                    {
                      "content": "# 3. Achiever, Performer\n\n*adaptable, excelling, driven, and image-conscious*\n\n## Categories\n\n- Triad: **Feeling**\n- Social style: **Assertive**\n- Coping: **Competency**\n\n## Correspondences\n\n- Desires: **Valuable**\n- Passions: **Deceit**\n- Fears: **Worthlessness**\n- Fixations: **Vanity**",
                      "children": [
                        {
                          "content": "> **Threes** try to deny their shame, and are potentially the most out of touch with underlying feelings of inadequacy. Threes learn to cope with shame by trying to become what they believe a valuable, successful person is like. Thus, Threes learn to perform well, to be acceptable, even outstanding, and are often driven relentlessly in their pursuit of success as a way of staving off feelings of shame and fears of failure."
                        }
                      ]
                    },
                    {
                      "content": "# 4. Individualist, Romantic\n\n*expressive, dramatic, self-absorbed, and temperamental*\n\n## Categories\n\n- Triad: **Feeling**\n- Social style: **Withdrawn**\n- Coping: **Reactive**\n\n## Correspondences\n\n- Desires: **Uniquely themselves**\n- Passions: **Evy**\n- Fears: **Insignificance**\n- Fixations: **Melancholy (Fantasizing)**",
                      "children": [
                        {
                          "content": "> **Fours** attempt to control their shame by focusing on how unique and special their particular talents, feelings, and personal characteristics are. Fours highlight their individuality and creativity as a way of dealing with their shameful feelings, although Fours are the type most likely to succumb to feelings of inadequacy. Fours also manage their shame by cultivating a rich, romantic fantasy life in which they do not have to deal with whatever in their life seems drab or uninteresting to them."
                        }
                      ]
                    },
                    {
                      "content": "# 5. Investigator, Observer\n\n*perceptive, innovative, secretive, and isolated*\n\n## Categories\n\n- Triad: **Thinking**\n- Social style: **Withdrawn**\n- Coping: **Competency**\n\n## Correspondences\n\n- Desires: **Mastery, understanding, knowledge**\n- Passions: **Avarice**\n- Fears: **Helplessness**\n- Fixations: **Stinginess (Retention)**",
                      "children": [
                        {
                          "content": "> **Fives** have fear about the outer world and about their capacity to cope with it. Thus, they cope with their fear by withdrawing from the world. Fives become secretive, isolated loners who use their minds to penetrate into the nature of the world. Fives hope that eventually, as they understand reality on their own terms, they will be able to rejoin the world and participate in it, but they never feel they know enough to participate with total confidence. Instead, they involve themselves with increasingly complex inner worlds."
                        }
                      ]
                    },
                    {
                      "content": "# 6. Loyalist, Loyal Skeptic\n\n*engaging, responsible, anxious, and suspicious*\n\n## Categories\n\n- Triad: **Thinking**\n- Social style: **Compliant**\n- Coping: **Reactive**\n\n## Correspondences\n\n- Desires: **Support, guidance**\n- Passions: **Fear**\n- Fears: **No support or guidance**\n- Fixations: **Cowardice (Worrying)**",
                      "children": [
                        {
                          "content": "> **Sixes** exhibit the most fear of all three types, largely experienced as anxiety, which causes them to be the most out of touch with their own sense of inner knowing and confidence. Unlike Fives, Sixes have trouble trusting their own minds, so they are constantly looking outside themselves for something to make them feel sure of themselves. They might turn to philosophies, beliefs, relationships, jobs, savings, authorities, or any combination of the above. But no matter how many security structures they create, Sixes still feel doubtful and anxious. They may even begin to doubt the very people and beliefs that they have turned to for reassurance. Sixes may also respond to their fear and anxiety by impulsively confronting it— defying their fear in the effort to be free of it."
                        }
                      ]
                    },
                    {
                      "content": "# 7. Enthusiast, Epicure\n\n*spontaneous, versatile, acquisitive, and scattered*\n\n## Categories\n\n- Triad: **Thinking**\n- Social style: **Assertive**\n- Coping: **Positive outlook**\n\n## Correspondences\n\n- Desires: **Fulfillment, contentment**\n- Passions: **Gluttony**\n- Fears: **Unfulfillment**\n- Fixations: **Planning (Anticipation)**",
                      "children": [
                        {
                          "content": "> **Sevens** have fear about their inner world. There are feelings of pain, loss, deprivation, and general anxiety that Sevens would like to stay clear of as much as possible. To cope with these feelings, Sevens keep their minds occupied with exciting possibilities and options— as long as they have something stimulating to anticipate, Sevens feel that they can distract themselves from their fears. Sevens, in most cases, do not stop merely at thinking about these options, however. As much as possible they attempt to actually do as many of their options as they can. Thus, Sevens can be found staying on the go, pursuing one experience after another, and keeping themselves entertained and engaged with their many ideas and activities."
                        }
                      ]
                    },
                    {
                      "content": "# 8. Challenger, Protector\n\n*self-confident, decisive, willful, and confrontational*\n\n## Categories\n\n- Triad: **Instinctive**\n- Social style: **Assertive**\n- Coping: **Reactive**\n\n## Correspondences\n\n- Desires: **Self-protection**\n- Passions: **Lust (Forcefulness)**\n- Fears: **Controlled**\n- Fixations: **Vengeance (Objectification)**",
                      "children": [
                        {
                          "content": "> **Eights** act out their anger and instinctual energies. In other words, when Eights feel anger building in them, they immediately respond to it in some physical way, raising their voices, moving more forcefully. Others can clearly see that Eights are angry because they give themselves permission to express their anger physically."
                        }
                      ]
                    },
                    {
                      "content": "# 9. Peacemaker, Mediator\n\n*receptive, reassuring, complacent, and resigned*\n\n## Categories\n\n- Triad: **Instinctive**\n- Social style: **Withdrawn**\n- Coping: **Positive outlook**\n\n## Correspondences\n\n- Desires: **Wholeness, peace of mind**\n- Passions: **Sloth (Disengagement)**\n- Fears: **Fragmentation**\n- Fixations: **Indolence (Daydreaming)**",
                      "children": [
                        {
                          "content": "> **Nines** deny their anger and instinctual energies as if to say, “What anger? I am not a person who gets angry.” Nines are the type most out of touch with their anger and instinctual energies, often feeling threatened by them. Of course, Nines get angry like everyone else, but try to stay out of their darker feelings by focusing on idealizations of their relationships and their world."
                        }
                      ]
                    }
                  ]
                },
                {
                  "content": "# Triads",
                  "children": [
                    {
                      "content": "# Centers\n\nClusters of shared emotions, drives, assets, liabilities.",
                      "children": [
                        {
                          "content": "## Instinctive\n\n*Concerned with maintaining resistance to reality. Create boundaries for the self based on physical tensions. Problems with aggression and repression*\n\n- **Seeks**: Autonomy\n- **Underlying feeling**: Rage\n- **Body**: Gut\n\n**Asleep**, they are resistant to present. *Boundaries, tension, numbness, defending, dissociating, irritation.*\n\n**Awake**, they live in the here and now. *Connected with life, relaxed, open, sensing, inner strength, grouped, acceptance.*\n\n- 8 act out rage (outward)\n- 9 deny rage\n- 1 repress rage (inward)"
                        },
                        {
                          "content": "## Feeling\n\n*Concerned with self-image. They attach to the false or assumed self of personality. Problems with identity and hostility.*\n\n- **Seeks**: Attention\n- **Underlying feeling**: Shame\n- **Body**: Heart\n\n**Asleep**, they focus on past orientation. *Self-image, stories, emotionality, holding onto moods, adapting to affect others.*\n\n**Awake**, they live in the here and now. *Authenticity, truthfulness, compassion, forgiveness and flow, inner-directed.*\n\n- 2 avoid shame (ultragood, outward)\n- 3 resist shame (perfectionism)\n- 4 trivialize shame (victimize, inward)"
                        },
                        {
                          "content": "## Thinking\n\n*Concerned with anxiety, strategies, and beliefs. Experience a lack of support and guidance. Problems with insecurity and anxiety.*\n\n- **Seeks**: Security\n- **Underlying feeling**: Fear\n- **Body**: Mind\n\n**Asleep**, they orient around the future. *Mental chatter, figuring it out, strategies, doubt, anxiety and fear, anticipation.*\n\n**Awake**, they live in the here and now. *Quiet mind, inner guidance, knowing, clarity, support and steadiness, open to present.*\n\n- 5 seek independence (fear outer, flee inward)\n- 6 seek support / father figure\n- 7 seek nurturing / mother figure (fear inner, flee outward)"
                        }
                      ]
                    },
                    {
                      "content": "# Hornevian groups\n\n**Social style**\n\nHow each type tries to get their primary needs met; how we pursue desires.",
                      "children": [
                        {
                          "content": "# Assertive\n\n*To get their needs meet, they demand them. Move against people, ego-oriented and ego-expansive.*\n\n**[3]** demands attention\n\nDo whatever wins recognition and attention\n\n**[7]** demands security\n\n\"I am going after whatever I need to feel secure\"\n\n**[8]** demands autonomy\n\nFight to assert their ego"
                        },
                        {
                          "content": "# Compliant\n\n*To get their needs met, they earn. Move toward people, need to be of service.*\n\n**[1]** earns autonomy\n\nIf they are perfect, others won't interfere\n\n**[2]** earns attention\n\nServe and do thoughtful things for others\n\n**[6]** earns security\n\n\"I will be safe if I do what is expected of me\""
                        },
                        {
                          "content": "# Withdrawn\n\n*To get their needs met, they withdraw. Move away from people, retreat into imagination.*\n\n**[4]** withdraws for attention\n\nHope that someone will come and discover them\n\n**[5]** withdraws for security\n\n\"I will be safe if I stay away from others\"\n\n**[9]** withdraws for autonomy\n\nHave their own space"
                        }
                      ]
                    },
                    {
                      "content": "# Harmonic groups\n\n**Coping style**\n\nHow types cope when they don't get what they want. How we defend against loss and disappointment.",
                      "children": [
                        {
                          "content": "# Positive-outlook\n\n*Deny they have any problems.*\n\n**[7]** \"There may be a problem, but I'm fine\"\n\nEmphasizes positive experiences. Avoids seeing their pain and emptiness. Overemphasis of own needs.\n\n**[9]** \"What's the problem? I don't think there's a problem\"\n\nEmphasizes positive qualities of others. Avoids seeing problems with their loved ones. Overwhelmed by needs of everyone.\n\n**[2]** \"You have a problem and I'm here to help\"\n\nEmphasizes positive self-image. Avoids seeing their own neediness and anger. Overemphasis of others' needs."
                        },
                        {
                          "content": "# Competency\n\n*Cut off feelings and solve problems logically.*\n\n**[1]** \"I'm sure we can solve this like mature adults\"\n\nEmphasizes being correct and organized. Manages feelings with repression and denial. Work with system, \"good boy / girl.\"\n\n**[3]** \"There's an efficient solution, we need to get to work\"\n\nEmphasizes being effective, capable, outstanding. Manages feelings with attention on tasks, staying active. Work with system but will move outside it.\n\n**[5]** \"There are a number of hidden issues, let me think\"\n\nEmphasizes being expert, having deep information. Manages feelings with abstracting feelings. Reject system, work outside it."
                        },
                        {
                          "content": "# Reactive\n\n*React strongly, need response of others.*\n\n**[4]** \"I'm hurt and need to express myself\"\n\nSeeks a rescuer, support, to be seen. Fears abandonment. Deals with others by them interested, playing \"hard to get.\"\n\n**[6]** \"I'm feeling pressured and need to let off steam\"\n\nSeeks independence with support. Fears losing support or becoming dependent. Deals with others by balancing reliance and independence.\n\n**[8]** \"I'm angry and you're going to hear about it\"\n\nSeeks independence by self-reliance. Fears being controlled or dominated. Deals with others by keeping guard up."
                        }
                      ]
                    }
                  ]
                },
                {
                  "content": "# Correspondences",
                  "children": [
                    {
                      "content": "# Desires\n\n1. Goodness, integrity\n2. Love\n3. Valuable\n4. Uniquely themselves\n5. Mastery, understanding, knowledge\n6. Support, guidance\n7. Fulfillment, contentment\n8. Self-protection\n9. Wholeness, peace of mind"
                    },
                    {
                      "content": "# Passions\n\n1. Anger\n2. Pride\n3. Deceit\n4. Evy\n5. Avarice\n6. Fear\n7. Gluttony\n8. Lust (Forcefulness)\n9. Sloth (Disengagement)"
                    },
                    {
                      "content": "# Fears\n\n1. Corruption\n2. Unloved\n3. Worthlessness\n4. Insignificance\n5. Helplessness\n6. No support or guidance\n7. Unfulfillment\n8. Controlled\n9. Fragmentation"
                    },
                    {
                      "content": "# Fixations\n\n1. Resentment\n2. Flattery (Ingratiation)\n3. Vanity\n4. Melancholy (Fantasizing)\n5. Stinginess (Retention)\n6. Cowardice (Worrying)\n7. Planning (Anticipation)\n8. Vengeance (Objectification)\n9. Indolence (Daydreaming)"
                    }
                  ]
                },
                {
                  "content": "# Reflections",
                  "children": [
                    {
                      "content": "# Elementals\n\nI'm imagining each enneagram type represented as some kind of \"elemental.\"\n\nMana series:\n\n- Jinn, the Elemental of Wind\n- Gnome, the Elemental of Earth\n- Undine, the Elemental of Water\n- Dryad, the Elemental of Wood\n- Salamander, the Elemental of Fire\n- Luna, the Elemental of the Moon\n- Aura, the Elemental of Gold\n- Wisp, the Elemental of Light\n- Shade, the Elemental of Darkness"
                    },
                    {
                      "content": "# Freedom from hierarchy\n\nWhat if we got rid of the given ordering and instead saw the types as freely associating? Each is like an element that describes the different parts of you. We have many types\n\n* Basic desire\n* Stress response\n* Communication style\n* Heroic virtue\n* Ego fixation"
                    },
                    {
                      "content": "# Cardinality\n\nThe Enneagram has an order of 9, so other things with that cardinality could be mapped to the Enneagram. Could we also adjust the cardinality of the Enneagram + its primary elements?"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "content": "# Tarot",
          "children": [
            {
              "content": "# Fool's Journey\n\nAs interpreted from http://www.learntarot.com/journey.htm",
              "children": [
                {
                  "content": "## 0: The Fool\n\n*Fool starts their journey, unaware of the road ahead.*\n\n* beginnings\n* ignorance\n* spontaneity \n* innocence"
                },
                {
                  "content": "## 1: The Magician\n\n*Fool encounter the active forces of the universe.*\n\n* positive energy\n* awareness\n* impact\n* concentration"
                },
                {
                  "content": "## 2: The High Priestess\n\n*Fool encounter the opposite balancing force, dark and instinctual*\n\n* negative energy\n* potential\n* instinct\n* patience"
                },
                {
                  "content": "## 3: The Empress\n\n*Fool comprehends their creator and initial source of life.*\n\n* creation\n* nurturing\n* sensation\n* abundance"
                },
                {
                  "content": "## 4: The Emperor\n\n*Fool encounters encounters structure and the ones who enforce it.*\n\n* structure\n* restriction\n* laws\n* authority"
                },
                {
                  "content": "## 5: The Hierophant\n\n*Fool encounters larger structures and groups that must be learned and adhered to.*\n\n* education\n* conformity\n* groups\n* belief systems"
                },
                {
                  "content": "## 6: The Lovers\n\n*Fool finds others and seeks relationship and connection.*\n\n* partnership\n* comparison\n* values\n* union"
                },
                {
                  "content": "## 7: The Chariot\n\n*Fool matures and asserts themselves on the world.*\n\n* willpower\n* mastery\n* control\n* victory"
                },
                {
                  "content": "## 8: Strength\n\n*Fool encounters suffering and must rely on their strengths.*\n\n* patience\n* courage\n* resolve\n* tolerance",
                  "children": [
                    {
                      "content": "Wild Unknown switches this with Justice. I almost like that more.\n\n* Chariot -> Justice -> Hermit, vs\n* Chariot -> Strength -> Hermit\n\nKrans's switch makes sense to me. Success and action (Chariot) causes pause and consideration for what's right (Justice), which leads to self-wondering (Hermit).\n\n* Wheel -> Strength -> Hanged, vs\n* Wheel -> Justice -> Hanged\n\nI also like these switched. I like Strength as a set up for the Hanged Man more than Justice. You can persevere all you want, but a new perspective is needed to start your journey of letting go.\n"
                    }
                  ]
                },
                {
                  "content": "## 9: The Hermit\n\n*Fool seeks to learn why to keep living among suffering.*\n\n* search\n* solitude\n* withdrawing\n* direction"
                },
                {
                  "content": "## 10: Wheel of Fortune\n\n*Fool sees the larger picture and connection between things, restoring purpose.*\n\n* vision\n* movement\n* destiny\n* turning"
                },
                {
                  "content": "## 11: Justice\n\n*Fool seeks to understand the meaning of their purpose.*\n\n* responsibility\n* cause\n* decision\n* fulfillment"
                },
                {
                  "content": "## 12: The Hanged Man\n\n*Fool encounters crisis and finds humility through release of control.*\n\n* surrender\n* sacrifice\n* suspension\n* release"
                },
                {
                  "content": "## 13: Death\n\n*Fool outgrows one part and moves onto the next.*\n\n* ending\n* transition\n* change\n* elimination"
                },
                {
                  "content": "## 14: Temperance\n\n*Fool regains balance and harmony after hardships.*\n\n* moderation\n* balance\n* health\n* poise"
                },
                {
                  "content": "## 15: The Devil\n\n*Fool perseveres through life but carries a dark seed of hopelessness.*\n\n* hopelessness\n* temptation\n* fatality\n* bondage"
                },
                {
                  "content": "## 16: The Tower\n\n*Fool may only break outside themselves with a sudden change.*\n\n* collapsing\n* revelation\n* destruction\n* unearthing"
                },
                {
                  "content": "## 17: The Star\n\n*Fool is bare and finds peace from inner darkness.*\n\n* serenity\n* hope\n* generosity\n* inspiration"
                },
                {
                  "content": "## 18: The Moon\n\n*Fool is vulnerable in their new calm and susceptible to fantasies.*\n\n* illusion\n* imagination\n* fear\n* haziness"
                },
                {
                  "content": "## 19: The Sun\n\n*Fool sees the path clarify and the way forward is illuminated.*\n\n* assurance\n* enlightenment\n* vitality\n* radiance"
                },
                {
                  "content": "## 20: Judgment\n\n*Fool understands their true self, unlocking deep judgment and decision to pursue destiny.*\n\n* rebirth\n* forgiveness\n* judgment\n* calling"
                },
                {
                  "content": "## 21: The World\n\n*Fool renters world with deeper understanding and completeness.*\n\n* integration\n* fulfillment\n* accomplishment\n* engagement"
                }
              ]
            }
          ]
        },
        {
          "content": "# Recovery",
          "children": [
            {
              "content": "# Twelve Stages of Healing\n\nCopied from https://enkindlewellness.com.au/network-life/twelve-stages-of-healing/",
              "children": [
                {
                  "content": "## 1: Suffering\n\n> Different from pain, suffering is marked by a profound awareness that something is wrong. Parts of our being are disconnected. The awareness of this disconnection is made as we draw more upon our consciousness and energetic resources. This can occur when confronted by a traumatic or chaotic event or loss. In the beginning phases of this stage, our awareness may be overwhelmed by the experience of pain associated with our symptoms or distressing circumstances. As you connect with the rhythm of this stage, you learn to accept and acknowledge that you feel helpless and are distressed, that it seems like nothing works, and that it will never end. This applies to an area of your body or your life. You feel disconnection, despair, or helplessness."
                },
                {
                  "content": "## 2: Polarities and Different Rhythms\n\n> This stage usually begins with the search for the specialist who can or has been identified as the savior from our distress, pain, or crisis. We project from the alienated, isolated, traumatized, hurt, shamed or ignored aspects of our being. These parts try to gain power over our helplessness through external authorities, procedures, treatments, etc. In this stage, we tend to think, “it’s okay if others make decisions for me, as long as they know what they are doing.” We feel that we have to know who or what to blame when things go wrong. “I don’t have to know all the details, just what I am supposed to do.” We tend to project our alienated parts onto others, or others keep projecting onto us. We also tend to judge our experience or others as good or bad, and feel extreme discomfort or dislike for anyone or anything that reminds us of our alienated part. At this stage, we have a definite story about how things are supposed to go and get upset when they go a different way, without knowing in advance that this will happen. As we connect to the rhythm of stage 2, we begin to become aware of our different parts and polarities, and we discover that we are somehow involved in a process. We are partially responsible for our distress."
                },
                {
                  "content": "## 3: Stuck in a Perspective\n\n> This stage of healing involves the recognition that our distress is associated with the fact that we are stuck in a perspective. Our concepts and our physiology have been fixated. We don’t know why we are stuck or what to do about it yet. The narrative of this stage runs like this: “I am stuck in my body, my shoulder, or back or neck, or particular area. I keep getting to the same point in my healing, or relationship, or life and feel like I ‘hit a wall’. It feels like I am running in circle and keep coming to the same point. I am so stuck and frustrated. I sometime resent the little kid in me who complains that he/she doesn’t know what to do.” At this stage we just need to acknowledge that we are stuck."
                },
                {
                  "content": "## 4: Reclaiming Our Power\n\n> This stage of healing is one in which we realize that the “script” determined by the above three stages no longer works for us. We are angry that we have lost our power and are determined not to let it happen again. You think, “I have had enough of this and wish to take my wholeness back. I deserve more than this. I don’t mean more than a symptom or circumstance. I mean I will no longer lessen who I am.” At this stage, our focus is no longer on a single cause or answer. It is not about our condition, it is about the courage to be ourselves."
                },
                {
                  "content": "## 5: Merging with the Illusion\n\n> In this stage of healing, we revisit our alienated self. We are now strong enough to own it, to merge past the illusion of self. We know there is more to our body sense or symptom than just physical pain. It seems like there is an emotion or an energy that must be recognized. We want to hold our body or part and ask it, “What do you want?” It seems as if there is a film or haze between what we are experiencing and a deeper level of ourselves. That divide or membrane is scary, but we have a sense that we must penetrate it, because it is an illusion. We know that past any potential discomfort we will be okay. We must see what is on the other side of the illusion. In this stage, we literally merge with the illusion of self, towards more wholeness."
                },
                {
                  "content": "## 6: Preparation for Resolution\n\n> The alienated, traumatized, denied, or redirected consciousness or energy is moving towards discharge and resolution. We feel the tension building within ourselves as this process advances. We feel ready to do whatever it takes to get on with our lives. We have a sense that there is something more waiting for us, and also a sense that we are not yet flexible enough or knowledgeable enough, or just not enough for what is next. We feel hungry for what’s coming, but in this stage, we just need to actively prepare. The sentiment is “I am ready! I am so ready that I am determined to do whatever it takes!”"
                },
                {
                  "content": "## 7: Resolution\n\n> Discharge of bio-electric energy is associated with a discharge of mechanical energy. This may be a discharge of the muscular system, or a fever, coughing, sneezing, or vomiting can be forms of discharge. Crying, screaming, and laughing are also discharge phenomena. When the discharge occurs after the previous six stages, resolution can occur with the discharge. A sense of accomplishment, satisfaction, peace, and inner strength accompanies the process when resolution occurs. The sentiment is, “I am so ready to scream and not only discharge, but resolve the recurrent energy pattern distracting me from who I really am! I am fully committed to do this now. I must let go of this now!”"
                },
                {
                  "content": "## 8: Emptiness in Connectedness\n\n> After the discharge we are emptied. Rather than a space of nothingness, we find ourselves in a place of possibilities. We enter into a state of gratitude, vulnerability, connection with our external rhythms, and alignment with events around us. We welcome serendipity as a natural way of life. The sentiment is, ” I do things because they feel right- not to move towards pleasure and avoid pain. I do things because it is the time to do them. I know that I will be supported by an abundant universe in my choices. I experience peace when at times my thoughts, inner noise, or static cease. I sense more room in my body for breath. I sense the rhythms within and sometimes around me. I feel gratitude for my connection to others and in a greater cosmic plan.”"
                },
                {
                  "content": "## 9: Light Behind the Form\n\n> From our place of emptiness and gratitude, we can truly appreciate our energetic fullness. Our inner sense runs as follows, “I sometimes feel the energy within my symptoms, underlying my emotions, within my spirit. Sometimes I feel the energy between people, and the primary organising subtle energy fields to which my body is connected. I feel the energy in people’s words, their eyes, or their being. I am more sensitive to love as a basic energy of the universe and find it all around me, and within me. I am grateful for this energetic awakening. I experience gratitude for the love within me and in the universe.”"
                },
                {
                  "content": "## 10: Ascent\n\n> We experience our union with the creative force of the universe. We transcend the limits, boundaries, language, and judgements of our existing sense of self. We gain the wisdom of knowing the oneness of all of creation during this stage. We feel as follows: “I have had moments where I have merged past the illusion that I am separate from the spirit of all of life, the essence of love, and my experience of the most Divine. I had had the experience that I am within all, and all of life is connected to me. I have experienced the grace of love as a physical and spiritual phenomenon through light, vibration, or touch. I know that I know and am humbled by this experience of the infinite element of life. I am grateful to witness this Greatness."
                },
                {
                  "content": "## 11: Descent\n\n> We are renewed beyond our limits and sense of self and enter into the world again. We know that we are part of all we perceive and responsible for all that we know. We live without being attached to our circumstances. We love and we serve. We participate in a larger circle of life, knowing our gifts and having a burning desire to effortlessly share them with the world, in service. Our inner thoughts and desires are magically and naturally matched by our outer experience. For extended periods, irrespective of external circumstance, I can fin a place and experience compassion, empathy, love, forgiveness, and altruism. I long to serve others with the gifts of my soul. This is in how I am, when I do what I do."
                },
                {
                  "content": "## 12: Community\n\n> We experience our involvement with humanity and recognize that wholeness comes from bringing our individual gifts into community. This occurs in our internal and external communities. We recognize that all of our choices are spiritual ones and affect all beings. Our dialogue runs as follows, “At times I recognize that we are each other’s medicine, and that first, I must be my own medicine. My life and success in life is a function of the relationships that I share with others. I celebrate and receive divergent energies and help them to join, transforming them into new possibilities and love. I seek those parts of my body and life that have become separate and invite them to join the community of self and of selves.”"
                }
              ]
            },
            {
              "content": "# Five Stages of Grief\n\nCopied from https://en.wikipedia.org/wiki/Five_stages_of_grief",
              "children": [
                {
                  "content": "## 1. Denial\n\n> The first reaction is denial. In this stage, individuals believe the diagnosis is somehow mistaken, and cling to a false, preferable reality."
                },
                {
                  "content": "## 2. Anger\n\n> When the individual recognizes that denial cannot continue, they become frustrated, especially at proximate individuals. Certain psychological responses of a person undergoing this phase would be: \"Why me? It's not fair!\"; \"How can this happen to me?\"; \"Who is to blame?\"; \"Why would this happen?\"."
                },
                {
                  "content": "## 3. Bargaining\n\n> The third stage involves the hope that the individual can avoid a cause of grief. Usually, the negotiation for an extended life is made in exchange for a reformed lifestyle. People facing less serious trauma can bargain or seek compromise. Examples include the terminally ill person who \"negotiates with God\" to attend a daughter's wedding, an attempt to bargain for more time to live in exchange for a reformed lifestyle or a phrase such as \"If I could trade their life for mine\"."
                },
                {
                  "content": "## 4. Depression\n\n> \"I'm so sad, why bother with anything?\"; \"I'm going to die soon, so what's the point?\"; \"I miss my loved one; why go on?\" During the fourth stage, the individual despairs at the recognition of their mortality. In this state, the individual may become silent, refuse visitors and spend much of the time mournful and sullen."
                },
                {
                  "content": "## 5. Acceptance\n\n> \"It's going to be okay.\"; \"I can't fight it; I may as well prepare for it.\" In this last stage, individuals embrace mortality or inevitable future, or that of a loved one, or other tragic event. People dying may precede the survivors in this state, which typically comes with a calm, retrospective view for the individual, and a stable condition of emotions."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "content": "# Book wish list",
      "children": [
        {
          "content": "# Topics\n\n- Nausicaa\n- Steven Universe\n- Lamps (Moroccan, Art Nouveau)\n- Stained glass windows (Tiffany)\n- Scythians\n- Arches\n- Bridges\n- Clocks and watches\n- Ferns\n- Golden Guides set\n- Shadow puppetry\n- Fancy hotels (Queen's Gambit)\n- Timber-framed houses (Tudor)\n- Villains\n- Snails\n- Salamanders\n- Growth patterns\n  - *On Growth and Form*\n- Poetry of Yunus Emre\n- Kaleidoscope\n- Jim French (Colt), Lüger\n- Enochian"
        },
        {
          "content": "# Books I've taken pictures of\n\n- Wonders"
        }
      ]
    },
    {
      "content": "# Dictionary defs",
      "children": [
        {
          "content": "# Medium",
          "children": [
            {
              "content": "Webster's 1913\n\n> 2\\. A substance through which an effect is transmitted from one thing to another; as, air is the common medium of sound. Hence: The condition upon which any event or action occurs; necessary means of motion or action; that through or by which anything is accomplished, conveyed, or carried on; specifically, in animal magnetism, spiritualism, etc., a person through whom the action of another being is said to be manifested and transmitted."
            }
          ]
        },
        {
          "content": "# Rude",
          "children": [
            {
              "content": "Webster's 1913\n\n> 1\\. Characterized by roughness; umpolished; raw; lacking delicacy or refinement; coarse.\n\n> Such gardening tools as art, yet *rude*, ... had formed. —*Milton*.\n\n> 2\\. Hence, specifically:\n\n> (a) Unformed by taste or skill; not nicely finished; not smoothed or polished; – said especially of material things; as, *rude* workmanship. “*Rude* was the cloth.” –*Chaucer*.\n> - *Rude* and unpolished stones. –*Bp. Stillingfleet*.\n> - The heaven-born child\n    All meanly wrapt in the *rude* manger lies.\n    –*Milton*.\n\n> (b) Of untaught manners; unpolished; of low rank; uncivil; clownish; ignorant; raw; unskillful; – said of persons, or of conduct, skill, and the like. “Mine ancestors were *rude*.” –*Chaucer*.\n> - He was but rude in the profession of arms. –*Sir H. Wotton*.\n> - the *rude* forefathers of the hamlet sleep. –*Gray*.\n\n> (c) Violent; tumultuous; boisterous; inclement; harsh; severe; – said of the weather, of storms, and the like; as, the *rude* winter.\n> - [Clouds] pushed with winds, *rude* in their shock. –*Milton*.\n> - The *rude* agitation [of water] breaks it into foam. *Boyle*.\n\n> (d) Barbarous; fierce; bloody; impetuous; – said of war, conflict, and the like; as, the *rude* shock of armies.\n\n> (e) Not finished or complete; inelegant; lacking chasteness or elegance; not in good taste; unsatisfactory in mode of treatment; – said of literature, language, style, and the like. “The *rude* Irish books.” –*Spenser*.\n> - *Rude* am I in my speech. –*Shak*.\n> - Unblemished by my *rude* translation. –*Dryden*.\n\n> **Syn**. – Impertinent; rough; uneven; shapeless; unfashioned; rugged; artless; unpolished; uncouth; inelegant; rustic; coarse; vulgar; clownish; raw; unskillful; untaught; illiterate; ignorant; uncivil; impolite; saucy; impudent; insolent; surly; currish; churlish; brutal; uncivilized; barbarous; savage; violent; fierce; tumultuous; turbulent; impetuous; boisterous; harsh; inclement; severe."
            },
            {
              "content": "Apple dictionary\n\n> 1\\. offensively impolite or ill-mannered: *she **had been rude** to her boss* | [with infinitive] : *it's rude to talk about people right in front of them*.\n> - (chiefly British) referring to a taboo subject such as sex in a way considered improper and offensive: *Graham giggled at every rude joke*.\n\n> 2\\. [attributive] having a startling abruptness: *the war came as a very **rude awakening***.\n\n> 3\\. [attributive] chiefly British vigorous or hearty: *Isabel had always been in **rude** health*.\n\n> 4\\. (dated) roughly made or done; lacking subtlety or sophistication: a *rude coffin*.\n> - (archaic) ignorant and uneducated: *the new religion was first promulgated by rude men*.\n\n> ORIGIN\n> Middle English (in rude (sense 4) , also ‘uncultured’): from Old French, from Latin rudis ‘unwrought’ (referring to handicraft), figuratively ‘uncultivated’; related to rudus ‘broken stone’."
            }
          ]
        },
        {
          "content": "# Vessel",
          "children": [
            {
              "content": "Webster's 1913\n\n> 1\\. A hollow or concave utensil for holding anything; a hollow receptacle of any kind, as a hogshead, a barrel, a firkin, a bottle, a kettle, a cup, a bowl, etc.\n\n> 2\\. A general name for any hollow structure made to float upon the water for purposes of navigation; especially, one that is larger than a common rowboat; as, a war vessel; a passenger vessel.\n\n> 3\\. *Fig*.: A person regarded as receiving or containing something; esp. (*Script*.), one into whom something is conceived as poured, or in whom something is stored for use; as, vessels of wrath or mercy."
            }
          ]
        }
      ]
    },
    {
      "content": "<div class=\"section\">Gingko</div>\n\nStuff specific to Gingko"
    },
    {
      "content": "# Style blocks",
      "children": [
        {
          "content": "**Coin template** `<span class=\"coin\"></span>`\n\n<span class=\"coin\"></span>\n<style>\n  .coin {\n    display: flex;\n    align-items: center;\n    justify-content: center;\n\n    position: absolute;\n    top: 10px;\n    right: 10px;\n\n    background-color: #ddd;\n    color: #444;\n\n    border: 2px solid currentColor;\n    border-radius: 50%;\n\n    font-weight: bold;\n\n    width: 2em;\n    height: 2em;\n  }\n\n  .coin::before {\n    content: '.';\n    display: block;\n  }\n</style>",
          "children": [
            {
              "content": "**Gray's coin** `<span \"coin gray\"></span>`\n\n<span class=\"coin gray\"></span>\n<style>\n  .coin.gray {\n    background-color: #ffeda8;\n    color: #df6d3a;\n  }\n\n  .coin.gray::before {\n    content: '⧋';\n    transform: translateY(-1px);\n  }\n</style>"
            },
            {
              "content": "**Lyric's coin** `<span class=\"coin lyric\"></span>`\n\n<span class=\"coin lyric\"></span>\n<style>\n  .lyric {\n    color: #0a768e;\n    background-color: #3de6ce;\n  }\n\n  .lyric::before {\n    content: '⟐';\n  }\n</style>"
            },
            {
              "content": "**Haven's coin** `<span class=\"coin haven\"></span>`\n\n<span class=\"coin haven\"></span>\n<style>\n  .haven {\n    background-color: #e8a9cf;\n    color: #861e6c;\n  }\n\n  .haven::before {\n    content: '⏀';\n    font-size: 1.5em;\n  }\n</style>"
            },
            {
              "content": "**All coins**\n\n<div class=\"purse\">\n  <span class=\"coin gray\"></span>\n  <span class=\"coin lyric\"></span>\n  <span class=\"coin haven\"></span>\n</div>"
            }
          ]
        },
        {
          "content": "**Coin purse (6)** `<div class=\"purse\"></div>`\n\n<div class=\"purse\">\n  <span class=\"coin\"></span>\n  <span class=\"coin\"></span>\n  <span class=\"coin\"></span>\n</div>\n\n<style>\n  .purse {\n    height: 0;\n    width: 0;\n  }\n\n  .purse .coin {\n    transform: translateY(0);\n    z-index: 6;\n  }\n\n  .purse .coin\n       ~ .coin {\n    transform: translateY(10px);\n    z-index: 5;\n  }\n\n  .purse .coin\n       ~ .coin\n       ~ .coin {\n    transform: translateY(20px);\n    z-index: 4;\n  }\n\n  .purse .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin {\n    transform: translateY(30px);\n    z-index: 3;\n  }\n\n  .purse .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin {\n    transform: translateY(40px);\n    z-index: 2;\n  }\n\n  .purse .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin\n       ~ .coin {\n    transform: translateY(50px);\n    z-index: 1;\n  }\n</style>"
        },
        {
          "content": "**Section** `<div class=\"section\">Section</div>`\n\n<div class=\"section\">Section</div>\n\nWith a short description\n\n<style>\n  .section {\n    background-color: rgba(251, 236, 191, 0.84);\n    font-size: 2rem;\n    font-family: \"Helvetica Neue\",Helvetica,Arial,sans-serif;\n    padding: 1rem;\n    text-align: center;\n    text-transform: uppercase;\n  }\n\n  .section::before,\n  .section::after {\n    content: '👇';\n    display: inline-block;\n    font-size: 1.5em;\n    color: #884321;\n  }\n\n  .section::before {\n\n    margin-right: 1em;\n  }\n\n  .section::after {\n    transform: scaleX(-1);\n    margin-left: 1em;\n  }\n\n  .section + p {\n    font-style: italic;\n    margin-top: 1em;\n  }\n</style>"
        },
        {
          "content": "**Captioned blockquote** `<blockquote title=\"Title\" cite=\"www.example.com\">Blockquote text</blockquote>`\n\n<blockquote title=\"Title\" cite=\"www.example.com\">Blockquote text with both `title` and `cite`</blockquote>\n\n<blockquote cite=\"www.example.com/really/long/url/to/show/that/text/will/be/truncated\">Blockquote text with just `cite`</blockquote>\n\n<blockquote title=\"Title\">Blockquote text with just `title`</blockquote>\n\n<style>\n  blockquote[title]::after,\n  blockquote[cite]::after,\n  blockquote[title][cite]::after {\n    display: list-item;\n    font-size: 0.9em;\n    font-style: italic;\n    list-style-image: url('data:image/svg+xml;utf8,<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1em 1em\" width=\"0.6em\" height=\"1em\"><text x=\"0\" y=\"1em\">—</text></svg>');\n    padding-left: 1em;\n    margin-left: -1em;\n    list-style-position: inside;\n    margin-top: 1rem;\n    overflow-x: hidden;\n    text-indent: -1em;\n    text-overflow: ellipsis;\n    white-space: pre;\n  }\n\n  blockquote[title]::after {\n    content: attr(title);\n  }\n\n  blockquote[cite]::after {\n    content: attr(cite);\n  }\n\n  blockquote[cite][title]::after {\n    content: attr(title)'\\a'attr(cite);\n  }\n</style>"
        }
      ]
    }
  ]
}
